export const acidOriginiumSlugAlpha = {
  slug: "acid-originium-slug-alpha",

  code: "UNKNOWN",

  name: "산성원석충 · α",
  enName: "Acid Originium Slug α",

  faction: "Infected Wildlife",
  tier: "Normal",

  description:
    "야생의 감염된 생물, 일반적인 산성원석충보다 더 위협적입니다. 등에 짊어진 오리지늄 클러스터가 활성화될수록 공격성이 더 강해집니다.",

  summaryStats: {
    hp: {
      level1: 249,
      level20: 1788,
      level40: 11316,
      level60: 44551,
      level80: 107164,
      level100: 198780,
    },

    attack: {
      level1: 30,
      level20: 140,
      level40: 434,
      level60: 1078,
      level80: 1622,
      level100: 2079,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 60,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 25,

    critRate: 0,
    critDamage: 50,

    attackRange: 6,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "겁이 많아서 껍질 속으로 숨어 자신을 보호하며, 주변에 마구잡이로 몸의 오리지늄을 발사해 적을 쫓아냅니다.",
  ],

  hp: [
    249,284,322,361,403,473,550,636,731,834,
    893,952,1059,1172,1292,1418,1550,1629,1709,1788,
    1967,2160,2367,2590,2830,3087,3363,3684,4030,4402,
    4966,5465,6007,6595,7234,7926,8676,9488,10366,11316,
    12247,13239,14293,15413,16602,17863,19200,20615,22113,23696,
    25804,27463,29216,31067,33022,35086,37264,39564,41990,44551,
    47278,50005,52972,55934,59030,62106,65445,68758,72723,76997,
    79841,82576,85553,88416,91530,94522,97776,100902,104298,107164,
    112165,117332,122669,128179,133867,139735,145788,152029,158461,165089,
    169133,173239,177410,181646,184449,187272,190117,192984,195871,198780,
  ],

  attack: [
    30,34,38,43,48,53,58,63,69,75,
    80,86,92,99,105,112,118,125,132,140,
    147,155,164,172,181,189,198,207,217,226,
    246,263,281,300,320,341,363,386,409,434,
    460,487,514,543,573,604,636,670,704,740,
    781,819,859,900,942,968,995,1022,1050,1078,
    1108,1138,1168,1199,1231,1262,1295,1327,1362,1396,
    1419,1440,1463,1485,1508,1531,1554,1576,1600,1622,
    1645,1669,1692,1716,1739,1763,1787,1810,1834,1858,
    1881,1904,1927,1950,1971,1993,2014,2036,2057,2079,
  ],

  defense: Array(100).fill(100),
} as const;