export const aethillu = {
  slug: "aethillu",

  code: "UNKNOWN",

  name: "잔영",
  enName: "Æthillu",

  faction: "Adashir Phantom",
  tier: "Normal",

  description:
    "아다시르가 소환한 환영, 한때 파멸의 상징이었으며 오래전에 퇴적된 잔재입니다.",

  summaryStats: {
    hp: {
      level1: 111,
      level20: 795,
      level40: 5029,
      level60: 19800,
      level80: 47629,
      level100: 88347,
    },

    attack: {
      level1: 49,
      level20: 233,
      level40: 723,
      level60: 1796,
      level80: 2703,
      level100: 3465,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 80,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 25,

    critRate: 0,
    critDamage: 50,

    attackRange: 7,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "C",
      damageTaken: 80,
    },

    heat: {
      grade: "C",
      damageTaken: 80,
    },

    electric: {
      grade: "C",
      damageTaken: 80,
    },

    cold: {
      grade: "C",
      damageTaken: 80,
    },

    natural: {
      grade: "C",
      damageTaken: 80,
    },
  },

  traits: [
    "강력한 부활 능력을 보유하고 있습니다. 부활 후 공격 범위가 더욱 넓어집니다. 부활 이후 자폭 공격을 사용하며 큰 피해를 입힙니다.",
  ],

  hp: [
    111,126,143,160,179,210,245,283,325,371,
    397,423,471,521,574,630,689,724,759,795,
    874,960,1052,1151,1258,1372,1495,1637,1791,1957,
    2207,2429,2670,2931,3215,3523,3856,4217,4607,5029,
    5443,5884,6352,6850,7379,7939,8533,9162,9828,10532,
    11469,12206,12985,13808,14676,15594,16562,17584,18662,19800,
    21013,22224,23543,24860,26236,27602,29087,30559,32321,34221,
    35485,36700,38024,39296,40680,42010,43456,44845,46355,47629,
    49851,52147,54519,56969,59496,62105,64795,67568,70427,73373,
    75170,76995,78849,80732,81977,83232,84497,85770,87054,88347,
  ],

  attack: [
    49,57,64,72,80,88,97,106,115,124,
    134,144,154,164,175,186,197,209,221,233,
    246,259,273,287,301,316,331,346,361,377,
    409,438,469,501,534,569,605,643,682,723,
    766,811,857,905,955,1007,1061,1116,1174,1234,
    1301,1365,1431,1500,1570,1614,1659,1704,1750,1796,
    1846,1896,1947,1998,2051,2104,2158,2212,2269,2326,
    2364,2401,2439,2476,2514,2551,2590,2627,2666,2703,
    2742,2781,2820,2859,2899,2938,2978,3017,3057,3097,
    3135,3174,3212,3250,3286,3321,3357,3393,3429,3465,
  ],

  defense: Array(100).fill(100),
} as const;