export const armoredManglerbeast = {
  slug: "armored-manglerbeast",

  code: "UNKNOWN",

  name: "무장 맹글러",
  enName: "Armored Manglerbeast",

  faction: "Talos II Wildlife",
  tier: "Elite",

  description:
    "탈로스 II에서 진화한 특수한 맹글러. 몸에는 매우 두꺼운 비늘 갑각을 두르고 있으며, 록하울러와는 서로 도움을 주고받는 공생 관계를 맺고 있습니다. 마치 정찰병과 돌격수처럼 빈틈없는 호흡을 보여주는 좋은 파트너입니다.",

  summaryStats: {
    hp: {
      level1: 1177,
      level20: 8445,
      level40: 53438,
      level60: 210378,
      level80: 506053,
      level100: 938684,
    },

    attack: {
      level1: 33,
      level20: 155,
      level40: 482,
      level60: 1198,
      level80: 1802,
      level100: 2310,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 280,
    staggerRecovery: "8s",

    finisherAtkMultiplier: 1.5,
    finisherSpGain: 50,

    critRate: 0,
    critDamage: 50,

    attackRange: 7,
    weight: 1.5,
  },

  resistances: {
    physical: {
      grade: "C",
      damageTaken: 80,
    },

    heat: {
      grade: "C",
      damageTaken: 80,
    },

    electric: {
      grade: "C",
      damageTaken: 80,
    },

    cold: {
      grade: "C",
      damageTaken: 80,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "등에 탄 록하울러는 바나나 껍질을 투척할 수 있습니다. 무장 맹글러가 돌진 공격을 시도하다 바나나 껍질을 밟으면 미끄러져 넘어집니다.",
    "몸을 웅크리고 방어할 때는 손이 유일한 약점입니다. 팔을 파괴하면 방어 상태가 해제되고 넘어집니다.",
    "넘어졌을 때 록하울러는 추락하며, 록하울러를 공격하면 더 큰 피해를 줄 수 있습니다.",
  ],

  hp: [
    1177,1343,1519,1705,1901,2232,2599,3004,3450,3939,
    4216,4498,5001,5535,6099,6695,7321,7693,8068,8445,
    9289,10198,11178,12231,13362,14577,15880,17397,19030,20788,
    23451,25806,28366,31144,34159,37428,40969,44803,48952,53438,
    57835,62515,67493,72782,78397,84353,90665,97349,104420,111897,
    121854,129688,137964,146706,155937,165682,175970,186829,198288,210378,
    223259,236133,250147,264134,278755,293276,309046,324692,343414,363598,
    377026,389942,404001,417519,432223,446356,461720,476482,492520,506053,
    529666,554066,579268,605290,632149,659861,688443,717914,748290,779589,
    798682,818075,837772,857774,871007,884342,897776,911311,924947,938684,
  ],

  attack: [
    33,38,43,48,53,59,65,71,77,83,
    89,96,103,110,117,124,132,139,147,155,
    164,173,182,191,201,210,220,230,241,251,
    273,292,313,334,356,379,403,429,455,482,
    511,541,571,604,637,671,707,744,783,823,
    868,910,954,1000,1047,1076,1106,1136,1167,1198,
    1231,1264,1298,1332,1368,1402,1439,1475,1513,1551,
    1576,1600,1626,1650,1676,1701,1726,1751,1777,1802,
    1828,1854,1880,1906,1932,1959,1985,2012,2038,2065,
    2090,2116,2141,2167,2191,2214,2238,2262,2286,2310,
  ],

  defense: Array(100).fill(100),
} as const;