export const axeArmorbeast = {
  slug: "axe-armorbeast",

  code: "UNKNOWN",

  name: "엑스 아머비스트",
  enName: "Axe Armorbeast",

  faction: "Beast",
  tier: "Elite",

  description:
    "야생의 엑스 아머비스트, 뼈로 된 갑옷을 두르고 있습니다. 돌격 상태에 들어가면, 도끼 모양의 거대한 뿔로 두꺼운 합금 문마저 부숴 버릴 수 있습니다.",

  summaryStats: {
    hp: {
      level1: 1385,
      level20: 9936,
      level40: 62869,
      level60: 247504,
      level80: 595357,
      level100: 1104334,
    },

    attack: {
      level1: 66,
      level20: 310,
      level40: 965,
      level60: 2395,
      level80: 3604,
      level100: 4620,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 280,
    staggerRecovery: "9s",

    finisherAtkMultiplier: 1.5,
    finisherSpGain: 50,

    critRate: 0,
    critDamage: 50,

    attackRange: 7,
    weight: 2,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "분노한 엑스 아머비스트는 자기 영역에 침입한 모든 적을 거대한 뿔로 몰아냅니다. 돌진을 반드시 조심하세요.",
    "여러 형태의 광역 범위 공격을 합니다. 놈이 분노하면 제때 공격을 중단시키세요.",
  ],

  hp: [
    1385,1580,1787,2006,2237,2626,3057,3534,4059,4635,
    4960,5291,5883,6511,7176,7876,8613,9051,9492,9936,
    10928,11998,13150,14389,15720,17149,18682,20467,22389,24457,
    27590,30361,33371,36640,40187,44032,48199,52709,57590,62869,
    68041,73547,79403,85626,92232,99239,106664,114528,122848,131644,
    143357,152574,162311,172595,183455,194921,207024,219799,233279,247504,
    262658,277803,294290,310746,327947,345031,363584,381990,404016,427763,
    443559,458756,475295,491199,508497,525125,543200,560567,579435,595357,
    623137,651842,681492,712106,743705,776307,809933,844605,880341,917164,
    939625,962441,985614,1009146,1024715,1040402,1056207,1072131,1088173,1104334,
  ],

  attack: [
    66,75,85,96,107,118,129,141,153,166,
    179,192,205,219,233,248,263,278,294,310,
    328,345,364,382,401,421,441,461,482,503,
    546,584,625,668,712,758,807,857,910,965,
    1022,1081,1143,1207,1274,1343,1414,1489,1565,1645,
    1735,1820,1908,2000,2094,2152,2212,2272,2333,2395,
    2462,2528,2597,2664,2735,2805,2878,2949,3026,3102,
    3152,3201,3252,3301,3352,3401,3453,3503,3554,3604,
    3656,3708,3760,3812,3865,3918,3970,4023,4076,4130,
    4180,4231,4283,4334,4381,4428,4476,4524,4572,4620,
  ],

  defense: Array(100).fill(100),
} as const;