export const blazemistOriginiumSlug = {
  slug: "blazemist-originium-slug",

  code: "UNKNOWN",

  name: "용암원석충",
  enName: "Blazemist Originium Slug",

  faction: "Originium Creature",
  tier: "Normal",

  description:
    "야생의 감염된 생물, 체온이 매우 높고 갑각에 포함된 오리지늄 분진의 활성이 더욱 강합니다. 이 살아있는 용암 덩어리에는 절대 가까이 다가가지 않는 것을 강력히 권장합니다.",

  summaryStats: {
    hp: {
      level1: 270,
      level20: 1937,
      level40: 12259,
      level60: 48263,
      level80: 116095,
      level100: 215345,
    },

    attack: {
      level1: 30,
      level20: 140,
      level40: 434,
      level60: 1078,
      level80: 1622,
      level100: 2079,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 60,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 25,

    critRate: 0,
    critDamage: 50,

    attackRange: 6,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "C",
      damageTaken: 80,
    },

    heat: {
      grade: "C",
      damageTaken: 80,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "C",
      damageTaken: 80,
    },
  },

  traits: [
    "생명력이 낮아지면 자폭합니다. 자폭은 피격된 오퍼레이터에게 불안정한 화합물을 남기며, 해당 오퍼레이터가 피해를 다시 받으면 이 화합물이 폭발합니다.",
  ],

  hp: [
    270,308,348,391,436,512,596,689,792,904,
    967,1032,1147,1270,1399,1536,1679,1765,1851,1937,
    2131,2340,2564,2806,3065,3344,3643,3991,4366,4769,
    5380,5920,6507,7145,7837,8586,9399,10278,11230,12259,
    13268,14342,15484,16697,17985,19352,20800,22333,23955,25671,
    27955,29752,31651,33656,35774,38010,40370,42861,45489,48263,
    51218,54172,57387,60596,63950,67281,70899,74488,78783,83414,
    86494,89457,92682,95784,99157,102399,105924,109311,112990,116095,
    121512,127109,132891,138861,145022,151380,157937,164698,171667,178847,
    183227,187676,192195,196783,199819,202878,205960,209066,212194,215345,
  ],

  attack: [
    30,34,38,43,48,53,58,63,69,75,
    80,86,92,99,105,112,118,125,132,140,
    147,155,164,172,181,189,198,207,217,226,
    246,263,281,300,320,341,363,386,409,434,
    460,487,514,543,573,604,636,670,704,740,
    781,819,859,900,942,968,995,1022,1050,1078,
    1108,1138,1168,1199,1231,1262,1295,1327,1362,1396,
    1419,1440,1463,1485,1508,1531,1554,1576,1600,1622,
    1645,1669,1692,1716,1739,1763,1787,1810,1834,1858,
    1881,1904,1927,1950,1971,1993,2014,2036,2057,2079,
  ],

  defense: Array(100).fill(100),
} as const;