export const bonekrusherInfiltrator = {
  slug: "bonekrusher-infiltrator",

  code: "UNKNOWN",

  name: "본 크러셔 침투자",
  enName: "Bonekrusher Infiltrator",

  faction: "Landbreaker",
  tier: "Normal",

  description:
    "쌍수 근거리 무기를 장비한 무장 랜드브레이커, 쌍수를 이용한 전투에 상당히 능숙합니다. 행동이 민첩한 건 물론, 근거리 전투가 특기이므로 신중하게 대응해야 합니다.",

  summaryStats: {
    hp: {
      level1: 166,
      level20: 1192,
      level40: 7544,
      level60: 29700,
      level80: 71443,
      level100: 132520,
    },

    attack: {
      level1: 33,
      level20: 155,
      level40: 482,
      level60: 1198,
      level80: 1802,
      level100: 2310,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 80,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 25,

    critRate: 0,
    critDamage: 50,

    attackRange: 2.3,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "매우 민첩하여 오퍼레이터의 일반 공격을 회피합니다. 하지만 공격 중에는 회피할 수 없습니다.",
    "표창을 던지고 적중된 오퍼레이터를 추격합니다. 표창을 피하면 반격을 위한 좋은 기회를 잡을 수 있습니다.",
  ],

  hp: [
    166,190,214,241,268,315,367,424,487,556,
    595,635,706,781,861,945,1034,1086,1139,1192,
    1311,1440,1578,1727,1886,2058,2242,2456,2687,2935,
    3311,3643,4005,4397,4822,5284,5784,6325,6911,7544,
    8165,8826,9528,10275,11068,11909,12800,13743,14742,15797,
    17203,18309,19477,20711,22015,23390,24843,26376,27994,29700,
    31519,33336,35315,37290,39354,41404,43630,45839,48482,51332,
    53227,55051,57035,58944,61020,63015,65184,67268,69532,71443,
    74776,78221,81779,85453,89245,93157,97192,101353,105641,110060,
    112755,115493,118274,121097,122966,124848,126745,128656,130581,132520,
  ],

  attack: [
    33,38,43,48,53,59,65,71,77,83,
    89,96,103,110,117,124,132,139,147,155,
    164,173,182,191,201,210,220,230,241,251,
    273,292,313,334,356,379,403,429,455,482,
    511,541,571,604,637,671,707,744,783,823,
    868,910,954,1000,1047,1076,1106,1136,1167,1198,
    1231,1264,1298,1332,1368,1402,1439,1475,1513,1551,
    1576,1600,1626,1650,1676,1701,1726,1751,1777,1802,
    1828,1854,1880,1906,1932,1959,1985,2012,2038,2065,
    2090,2116,2141,2167,2191,2214,2238,2262,2286,2310,
  ],

  defense: Array(100).fill(100),
} as const;