export const bonekrusherExecutioner = {
  slug: "bonekrusher-executioner",

  code: "UNKNOWN",

  name: "본 크러셔 처형자",
  enName: "Bonekrusher Executioner",

  faction: "Landbreaker",
  tier: "Elite",

  description:
    "중형 도끼를 장착한 랜드브레이커, 상당히 큰 덩치를 갖고 있습니다. 일반적인 랜드브레이커보다 좀 더 뛰어난 신체 능력을 갖고 있어 비교적 쉽게 전차를 뒤집거나 건물을 파괴합니다.",

  summaryStats: {
    hp: {
      level1: 1108,
      level20: 7948,
      level40: 50295,
      level60: 198003,
      level80: 476285,
      level100: 883467,
    },

    attack: {
      level1: 66,
      level20: 310,
      level40: 965,
      level60: 2395,
      level80: 3604,
      level100: 4620,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 320,
    staggerRecovery: "9s",

    finisherAtkMultiplier: 1.5,
    finisherSpGain: 50,

    critRate: 0,
    critDamage: 50,

    attackRange: 2.8,
    weight: 1.5,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "잡기 공격에 당하면 대량의 피해를 받습니다. 오퍼레이터가 잡혔다면, 다른 오퍼레이터는 스킬을 사용하여 빠르게 적의 공격을 끊어 구출하세요.",
    "차지 2단 도끼 휘두르기를 사용하면 회피하기 어렵습니다. 빠르게 적의 공격을 끊으세요.",
  ],

  hp: [
    1108,1264,1430,1605,1790,2101,2446,2827,3247,3708,
    3968,4233,4707,5209,5740,6301,6890,7241,7594,7948,
    8743,9598,10520,11511,12576,13720,14946,16373,17911,19565,
    22072,24288,26697,29312,32150,35226,38559,42168,46072,50295,
    54433,58838,63523,68501,73786,79391,85332,91622,98278,105315,
    114686,122059,129849,138076,146764,155936,165619,175839,186624,198003,
    210126,222243,235432,248597,262358,276025,290867,305592,323213,342210,
    354848,367004,380236,392959,406798,420100,434560,448454,463548,476285,
    498510,521474,545194,569685,594964,621046,647947,675684,704273,733731,
    751700,769953,788491,807316,819772,832321,844966,857705,870538,883467,
  ],

  attack: [
    66,75,85,96,107,118,129,141,153,166,
    179,192,205,219,233,248,263,278,294,310,
    328,345,364,382,401,421,441,461,482,503,
    546,584,625,668,712,758,807,857,910,965,
    1022,1081,1143,1207,1274,1343,1414,1489,1565,1645,
    1735,1820,1908,2000,2094,2152,2212,2272,2333,2395,
    2462,2528,2597,2664,2735,2805,2878,2949,3026,3102,
    3152,3201,3252,3301,3352,3401,3453,3503,3554,3604,
    3656,3708,3760,3812,3865,3918,3970,4023,4076,4130,
    4180,4231,4283,4334,4381,4428,4476,4524,4572,4620,
  ],

  defense: Array(100).fill(100),
} as const;