export const bonekrusherBallista = {
  slug: "bonekrusher-ballista",

  code: "UNKNOWN",

  name: "본 크러셔 사수",
  enName: "Bonekrusher Ballista",

  faction: "Landbreaker",
  tier: "Elite",

  description:
    "중형 원거리 무기를 장비한 무장 랜드브레이커, 저격수 중에서도 실력이 좋은 정예입니다. 이 사수들이 사용하는 무거운 화살은 목표의 중장갑마저도 뚫습니다.",

  summaryStats: {
    hp: {
      level1: 1246,
      level20: 8942,
      level40: 56582,
      level60: 222753,
      level80: 535821,
      level100: 993901,
    },

    attack: {
      level1: 72,
      level20: 341,
      level40: 1061,
      level60: 2635,
      level80: 3965,
      level100: 5081,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 320,
    staggerRecovery: "9s",

    finisherAtkMultiplier: 1.5,
    finisherSpGain: 50,

    critRate: 0,
    critDamage: 50,

    attackRange: 12,
    weight: 1.5,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "화살비를 발사하여 지속 피해를 주고, 몇 초 뒤 폭발을 일으킵니다.",
    "거대한 쇠뇌를 들고 있지만, 근거리 전투 능력도 무시할 수 없습니다.",
  ],

  hp: [
    1246,1422,1608,1805,2013,2363,2752,3181,3653,4171,
    4464,4762,5295,5860,6458,7088,7752,8146,8543,8942,
    9835,10798,11835,12950,14148,15435,16814,18420,20150,22011,
    24831,27324,30034,32976,36168,39629,43379,47438,51831,56582,
    61237,66193,71463,77063,83009,89315,95998,103075,110563,118479,
    129022,137317,146080,155336,165109,175428,186322,197819,209951,222753,
    236392,250023,264861,279672,295152,310528,327225,343791,363615,384986,
    399204,412880,427765,442079,457648,472612,488880,504511,521492,535821,
    560823,586658,613343,640896,669334,698676,728940,760144,792307,825447,
    845663,866197,887052,908231,922243,936362,950586,964918,979356,993901,
  ],

  attack: [
    72,83,94,105,117,130,142,155,168,182,
    196,211,226,241,257,273,289,306,323,341,
    360,380,400,421,442,463,485,507,530,553,
    600,643,688,734,783,834,888,943,1001,1061,
    1124,1189,1257,1328,1401,1477,1556,1637,1722,1810,
    1909,2002,2099,2200,2303,2367,2433,2499,2566,2635,
    2708,2781,2856,2931,3009,3085,3165,3244,3329,3412,
    3468,3521,3577,3631,3687,3741,3798,3853,3910,3965,
    4022,4079,4136,4194,4251,4309,4367,4426,4484,4543,
    4599,4655,4711,4767,4819,4871,4924,4976,5029,5081,
  ],

  defense: Array(100).fill(100),
} as const;