export const bonekrusherSiegeknuckles = {
  slug: "bonekrusher-siegeknuckles",

  code: "UNKNOWN",

  name: "본 크러셔 파괴자",
  enName: "Bonekrusher Siegeknuckles",

  faction: "Landbreaker",
  tier: "Elite",

  description:
    "중형 폭파 권갑을 장착한 무장 랜드브레이커, 본 크러셔 집단의 주력 전투 인원으로, 팔에 장착한 무기는 소형화된 공성 병기입니다.",

  summaryStats: {
    hp: {
      level1: 1246,
      level20: 8942,
      level40: 56582,
      level60: 222753,
      level80: 535821,
      level100: 993901,
    },

    attack: {
      level1: 26,
      level20: 124,
      level40: 386,
      level60: 958,
      level80: 1442,
      level100: 1848,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 320,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 50,

    critRate: 0,
    critDamage: 50,

    attackRange: 6,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "C",
      damageTaken: 80,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "C",
      damageTaken: 80,
    },

    cold: {
      grade: "C",
      damageTaken: 80,
    },

    natural: {
      grade: "C",
      damageTaken: 80,
    },
  },

  traits: [
    "공세가 끊임없이 이어집니다. 공세를 끊는다고 해도 공격을 계속할 수 있습니다.",
    "견갑에 달린 폭발형 반장갑 파편을 뿌립니다. 혹시라도 밟았다면 즉시 벗어나세요.",
    "지면의 파편을 회수해 재정비를 시도합니다. 회수에 성공하면 강력한 공격을 발동합니다.",
  ],

  hp: [
    1246,1422,1608,1805,2013,2363,2752,3181,3653,4171,
    4464,4762,5295,5860,6458,7088,7752,8146,8543,8942,
    9835,10798,11835,12950,14148,15435,16814,18420,20150,22011,
    24831,27324,30034,32976,36168,39629,43379,47438,51831,56582,
    61237,66193,71463,77063,83009,89315,95998,103075,110563,118479,
    129022,137317,146080,155336,165109,175428,186322,197819,209951,222753,
    236392,250023,264861,279672,295152,310528,327225,343791,363615,384986,
    399204,412880,427765,442079,457648,472612,488880,504511,521492,535821,
    560823,586658,613343,640896,669334,698676,728940,760144,792307,825447,
    845663,866197,887052,908231,922243,936362,950586,964918,979356,993901,
  ],

  attack: [
    26,30,34,38,43,47,52,56,61,66,
    71,77,82,88,93,99,105,111,118,124,
    131,138,145,153,161,168,176,184,193,201,
    218,234,250,267,285,303,323,343,364,386,
    409,432,457,483,509,537,566,595,626,658,
    694,728,763,800,837,861,885,909,933,958,
    985,1011,1039,1066,1094,1122,1151,1180,1210,1241,
    1261,1280,1301,1320,1341,1361,1381,1401,1422,1442,
    1462,1483,1504,1525,1546,1567,1588,1609,1631,1652,
    1672,1693,1713,1734,1752,1771,1790,1809,1829,1848,
  ],

  defense: Array(100).fill(100),
} as const;