export const bonekrusherArsonist = {
  slug: "bonekrusher-arsonist",

  code: "UNKNOWN",

  name: "본 크러셔 집행자",
  enName: "Bonekrusher Arsonist",

  faction: "Landbreaker",
  tier: "Enhanced",

  description:
    "화염방사기를 장비한 무장 랜드브레이커, 조악하지만 정교하게 제작된 소각 장비를 사용하며 단단한 엄폐물과 완강한 저항 세력을 쓸어버립니다.",

  summaryStats: {
    hp: {
      level1: 831,
      level20: 5961,
      level40: 37721,
      level60: 148502,
      level80: 357214,
      level100: 662600,
    },

    attack: {
      level1: 49,
      level20: 233,
      level40: 723,
      level60: 1796,
      level80: 2703,
      level100: 3465,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 170,
    staggerRecovery: "7s",

    finisherAtkMultiplier: 1.25,
    finisherSpGain: 35,

    critRate: 0,
    critDamage: 50,

    attackRange: 7,
    weight: 1.5,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "B",
      damageTaken: 50,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "오퍼레이터를 향해 지속적으로 불을 뿜습니다.",
    "최대한 적의 후방으로 회피하세요.",
  ],

  hp: [
    831,948,1072,1204,1342,1575,1834,2120,2435,2781,
    2976,3175,3530,3907,4305,4726,5168,5431,5695,5961,
    6557,7199,7890,8633,9432,10290,11209,12280,13433,14674,
    16554,18216,20023,21984,24112,26419,28919,31626,34554,37721,
    40825,44128,47642,51376,55339,59543,63999,68717,73709,78986,
    86014,91545,97387,103557,110073,116952,124214,131879,139968,148502,
    157595,166682,176574,186448,196768,207018,218150,229194,242410,256658,
    266136,275253,285177,294719,305098,315075,325920,336340,347661,357214,
    373882,391105,408895,427264,446223,465784,485960,506763,528205,550298,
    563775,577465,591368,605487,614829,624241,633724,643278,652904,662600,
  ],

  attack: [
    49,57,64,72,80,88,97,106,115,124,
    134,144,154,164,175,186,197,209,221,233,
    246,259,273,287,301,316,331,346,361,377,
    409,438,469,501,534,569,605,643,682,723,
    766,811,857,905,955,1007,1061,1116,1174,1234,
    1301,1365,1431,1500,1570,1614,1659,1704,1750,1796,
    1846,1896,1947,1998,2051,2104,2158,2212,2269,2326,
    2364,2401,2439,2476,2514,2551,2590,2627,2666,2703,
    2742,2781,2820,2859,2899,2938,2978,3017,3057,3097,
    3135,3174,3212,3250,3286,3321,3357,3393,3429,3465,
  ],

  defense: Array(100).fill(100),
} as const;