export const bonekrusherAmbusher = {
  slug: "bonekrusher-ambusher",

  code: "UNKNOWN",

  name: "본 크러셔 저격수",
  enName: "Bonekrusher Ambusher",

  faction: "Landbreaker",
  tier: "Normal",

  description:
    "기초적인 원거리 무기를 장비한 무장 랜드브레이커, 기초적인 사격 훈련만 받았기 때문에 잘 명중시키질 못합니다. 하지만 그래도 여전히 많은 사람이 사수들의 화살에 목숨을 잃습니다.",

  summaryStats: {
    hp: {
      level1: 180,
      level20: 1292,
      level40: 8173,
      level60: 32175,
      level80: 77396,
      level100: 143563,
    },

    attack: {
      level1: 28,
      level20: 132,
      level40: 410,
      level60: 1018,
      level80: 1532,
      level100: 1963,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 80,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 25,

    critRate: 0,
    critDamage: 50,

    attackRange: 7,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "해당 적은 특수 능력이 없습니다.",
  ],

  hp: [
    180,205,232,261,291,341,397,459,528,603,
    645,688,765,846,933,1024,1120,1177,1234,1292,
    1421,1560,1710,1871,2044,2229,2429,2661,2911,3179,
    3587,3947,4338,4763,5224,5724,6266,6852,7487,8173,
    8845,9561,10322,11131,11990,12901,13866,14889,15970,17114,
    18636,19835,21100,22437,23849,25340,26913,28574,30326,32175,
    34146,36114,38258,40397,42633,44854,47266,49659,52522,55609,
    57663,59638,61788,63856,66105,68266,70616,72874,75327,77396,
    81008,84739,88594,92574,96682,100920,105291,109799,114444,119231,
    122151,125117,128130,131189,133213,135252,137307,139377,141462,143563,
  ],

  attack: [
    28,32,36,41,45,50,55,60,65,70,
    76,81,87,93,99,105,112,118,125,132,
    139,147,155,162,171,179,187,196,205,214,
    232,248,266,284,303,322,343,364,387,410,
    434,460,486,513,541,571,601,633,665,699,
    737,774,811,850,890,915,940,966,992,1018,
    1046,1074,1104,1132,1162,1192,1223,1253,1286,1318,
    1340,1360,1382,1403,1425,1446,1467,1489,1511,1532,
    1554,1576,1598,1620,1643,1665,1687,1710,1732,1755,
    1777,1798,1820,1842,1862,1882,1902,1923,1943,1963,
  ],

  defense: Array(100).fill(100),
} as const;