export const bonekrusherRipptusk = {
  slug: "bonekrusher-ripptusk",

  code: "UNKNOWN",

  name: "본 크러셔 립터스크",
  enName: "Bonekrusher Ripptusk",

  faction: "Landbreaker",
  tier: "Normal",

  description:
    "무장 랜드브레이커가 조종하는 소형 워비스트, 야생의 터스크비스트보다 훨씬 더 사납고 포악합니다. 주인에게 절대적으로 충성하는 것이 특징입니다.",

  summaryStats: {
    hp: {
      level1: 152,
      level20: 1093,
      level40: 6916,
      level60: 27225,
      level80: 65489,
      level100: 121477,
    },

    attack: {
      level1: 30,
      level20: 140,
      level40: 434,
      level60: 1078,
      level80: 1622,
      level100: 2079,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 60,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 25,

    critRate: 0,
    critDamage: 50,

    attackRange: 2.1,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "민첩하지만, 연속 공격받으면 거의 대응하지 못합니다.",
  ],

  hp: [
    152,174,197,221,246,289,336,389,446,510,
    546,582,647,716,789,866,947,996,1044,1093,
    1202,1320,1447,1583,1729,1886,2055,2251,2463,2690,
    3035,3340,3671,4030,4421,4844,5302,5798,6335,6916,
    7485,8090,8734,9419,10146,10916,11733,12598,13513,14481,
    15769,16783,17854,18985,20180,21441,22773,24178,25661,27225,
    28892,30558,32372,34182,36074,37953,39994,42019,44442,47054,
    48792,50463,52282,54032,55935,57764,59752,61662,63738,65489,
    68545,71703,74964,78332,81808,85394,89093,92907,96838,100888,
    103359,105869,108418,111006,112719,114444,116183,117934,119699,121477,
  ],

  attack: [
    30,34,38,43,48,53,58,63,69,75,
    80,86,92,99,105,112,118,125,132,140,
    147,155,164,172,181,189,198,207,217,226,
    246,263,281,300,320,341,363,386,409,434,
    460,487,514,543,573,604,636,670,704,740,
    781,819,859,900,942,968,995,1022,1050,1078,
    1108,1138,1168,1199,1231,1262,1295,1327,1362,1396,
    1419,1440,1463,1485,1508,1531,1554,1576,1600,1622,
    1645,1669,1692,1716,1739,1763,1787,1810,1834,1858,
    1881,1904,1927,1950,1971,1993,2014,2036,2057,2079,
  ],

  defense: Array(100).fill(100),
} as const;