export const bonekrusherPyromancer = {
  slug: "bonekrusher-pyromancer",

  code: "UNKNOWN",

  name: "본 크러셔 염술사",
  enName: "Bonekrusher Pyromancer",

  faction: "Landbreaker",
  tier: "Enhanced",

  description:
    "오리지늄 아츠를 다루는 무장 랜드브레이커, 에너지 전환계 오리지늄 아츠를 다룹니다. 전장에서 맹렬한 불길을 퍼뜨리는 존재로 상당히 위협적인 존재입니다.",

  summaryStats: {
    hp: {
      level1: 761,
      level20: 5465,
      level40: 34578,
      level60: 136127,
      level80: 327446,
      level100: 607384,
    },

    attack: {
      level1: 49,
      level20: 233,
      level40: 723,
      level60: 1796,
      level80: 2703,
      level100: 3465,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 160,
    staggerRecovery: "7s",

    finisherAtkMultiplier: 1.25,
    finisherSpGain: 35,

    critRate: 0,
    critDamage: 50,

    attackRange: 7,
    weight: 1.5,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "B",
      damageTaken: 50,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "강력한 원거리 공격을 할 수 있으며, 열기 피해를 줄 수 있지만 이동 능력이 떨어집니다.",
    "지면에서 안갯불을 분출시켜 열기 피해를 줍니다. 주의해서 피하세요.",
    "가까이 다가가면 먼 곳으로 순간이동합니다.",
  ],

  hp: [
    761,869,983,1103,1230,1444,1681,1944,2232,2549,
    2728,2910,3236,3581,3947,4332,4737,4978,5221,5465,
    6011,6599,7233,7914,8646,9432,10275,11257,12314,13451,
    15174,16698,18354,20152,22103,24218,26509,28990,31675,34578,
    37423,40451,43672,47094,50728,54581,58665,62990,67566,72404,
    78847,83916,89271,94927,100900,107206,113863,120889,128304,136127,
    144462,152792,161860,170910,180371,189767,199971,210095,222209,235270,
    243958,252316,261412,270159,279673,288819,298760,308312,318689,327446,
    342725,358513,374821,391659,409038,426969,445463,464533,484188,504440,
    516794,529343,542088,555030,563593,572221,580914,589672,598495,607384,
  ],

  attack: [
    49,57,64,72,80,88,97,106,115,124,
    134,144,154,164,175,186,197,209,221,233,
    246,259,273,287,301,316,331,346,361,377,
    409,438,469,501,534,569,605,643,682,723,
    766,811,857,905,955,1007,1061,1116,1174,1234,
    1301,1365,1431,1500,1570,1614,1659,1704,1750,1796,
    1846,1896,1947,1998,2051,2104,2158,2212,2269,2326,
    2364,2401,2439,2476,2514,2551,2590,2627,2666,2703,
    2742,2781,2820,2859,2899,2938,2978,3017,3057,3097,
    3135,3174,3212,3250,3286,3321,3357,3393,3429,3465,
  ],

  defense: Array(100).fill(100),
} as const;