export const bonekrusherRaider = {
  slug: "bonekrusher-raider",

  code: "UNKNOWN",

  name: "본 크러셔 약탈자",
  enName: "Bonekrusher Raider",

  faction: "Landbreaker",
  tier: "Normal",

  description:
    "기초적인 근거리 무기를 장비한 무장 랜드브레이커, 랜드브레이커 집단을 구성하는 대다수의 랜드브레이커입니다. 조악한 장비를 들고 있긴 하지만, 종종 떼를 지어 나타납니다.",

  summaryStats: {
    hp: {
      level1: 194,
      level20: 1391,
      level40: 8802,
      level60: 34651,
      level80: 83350,
      level100: 154607,
    },

    attack: {
      level1: 36,
      level20: 171,
      level40: 531,
      level60: 1317,
      level80: 1982,
      level100: 2541,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 80,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 25,

    critRate: 0,
    critDamage: 50,

    attackRange: 2.3,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "해당 적은 특수 능력이 없습니다.",
  ],

  hp: [
    194,221,250,281,313,368,428,495,568,649,
    694,741,824,912,1005,1103,1206,1267,1329,1391,
    1530,1680,1841,2014,2201,2401,2616,2865,3134,3424,
    3863,4250,4672,5130,5626,6165,6748,7379,8063,8802,
    9526,10297,11116,11988,12912,13893,14933,16034,17199,18430,
    20070,21360,22724,24163,25684,27289,28983,30772,32659,34651,
    36772,38892,41201,43504,45913,48304,50902,53479,56562,59887,
    62098,64226,66541,68768,71190,73517,76048,78479,81121,83350,
    87239,91258,95409,99695,104119,108683,113391,118245,123248,128403,
    131548,134742,137986,141280,143460,145656,147869,150098,152344,154607,
  ],

  attack: [
    36,41,47,53,59,65,71,78,84,91,
    98,105,113,121,128,136,145,153,162,171,
    180,190,200,210,221,231,242,254,265,276,
    300,321,344,367,392,417,444,472,500,531,
    562,595,629,664,701,739,778,819,861,905,
    954,1001,1050,1100,1151,1184,1216,1250,1283,1317,
    1354,1390,1428,1465,1504,1543,1583,1622,1664,1706,
    1734,1761,1789,1815,1844,1871,1899,1926,1955,1982,
    2011,2039,2068,2097,2126,2155,2184,2213,2242,2271,
    2299,2327,2355,2384,2410,2436,2462,2488,2514,2541,
  ],

  defense: Array(100).fill(100),
} as const;