export const brutalPincerbeast = {
  slug: "brutal-pincerbeast",

  code: "UNKNOWN",

  name: "브루탈 핀서비스트",
  enName: "Brutal Pincerbeast",

  faction: "Infected Wildlife",
  tier: "Normal",

  description:
    "야생의 감염된 생물, 등에 대량의 오리지늄 클러스터를 짊어지고 있으며 체구가 거대합니다. 갑각이 일반 개체보다 두껍고, 등에 짊어진 오리지늄 클러스터의 활성이 더 강합니다.",

  summaryStats: {
    hp: {
      level1: 277,
      level20: 1987,
      level40: 12574,
      level60: 49501,
      level80: 119071,
      level100: 220867,
    },

    attack: {
      level1: 30,
      level20: 140,
      level40: 434,
      level60: 1078,
      level80: 1622,
      level100: 2079,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 60,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 25,

    critRate: 0,
    critDamage: 50,

    attackRange: 6,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "보통 무리를 지어 나타납니다. 놈들의 날카로운 앞다리를 조심하세요.",
  ],

  hp: [
    277,316,357,401,447,525,611,707,812,927,
    992,1058,1177,1302,1435,1575,1723,1810,1898,1987,
    2186,2400,2630,2878,3144,3430,3736,4093,4478,4891,
    5518,6072,6674,7328,8037,8806,9640,10542,11518,12574,
    13608,14709,15881,17125,18446,19848,21333,22906,24570,26329,
    28671,30515,32462,34519,36691,38984,41405,43960,46656,49501,
    52532,55561,58858,62149,65589,69006,72717,76398,80803,85553,
    88712,91751,95059,98240,101699,105025,108640,112113,115887,119071,
    124627,130368,136298,142421,148741,155261,161987,168921,176068,183433,
    187925,192488,197123,201829,204943,208080,211241,214426,217635,220867,
  ],

  attack: [
    30,34,38,43,48,53,58,63,69,75,
    80,86,92,99,105,112,118,125,132,140,
    147,155,164,172,181,189,198,207,217,226,
    246,263,281,300,320,341,363,386,409,434,
    460,487,514,543,573,604,636,670,704,740,
    781,819,859,900,942,968,995,1022,1050,1078,
    1108,1138,1168,1199,1231,1262,1295,1327,1362,1396,
    1419,1440,1463,1485,1508,1531,1554,1576,1600,1622,
    1645,1669,1692,1716,1739,1763,1787,1810,1834,1858,
    1881,1904,1927,1950,1971,1993,2014,2036,2057,2079,
  ],

  defense: Array(100).fill(100),
} as const;