export const cloudObliterator = {
  slug: "cloud-obliterator",

  code: "UNKNOWN",

  name: "개천장",
  enName: "Cloud Obliterator",

  faction: "Outlaw",
  tier: "Elite",

  description:
    "중형 무기를 장착한 불법 무장 세력. 하늘을 여는 것은 아무나 쉽게 할 수 있는 일이 아닙니다. 사중 장착 발사기를 메고 있는 무장 인원 중에서 오직 충분히 강한 자만이 '하늘을 여는 자'라는 칭호를 얻을 수 있습니다.",

  summaryStats: {
    hp: {
      level1: 1661,
      level20: 11923,
      level40: 75442,
      level60: 297005,
      level80: 714428,
      level100: 1325201,
    },

    attack: {
      level1: 66,
      level20: 310,
      level40: 965,
      level60: 2395,
      level80: 3604,
      level100: 4620,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 320,
    staggerRecovery: "9s",

    finisherAtkMultiplier: 1.5,
    finisherSpGain: 50,

    critRate: 0,
    critDamage: 50,

    attackRange: 2.8,
    weight: 1.5,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "C",
      damageTaken: 80,
    },

    electric: {
      grade: "C",
      damageTaken: 80,
    },

    cold: {
      grade: "C",
      damageTaken: 80,
    },

    natural: {
      grade: "C",
      damageTaken: 80,
    },
  },

  traits: [
    "대포를 휘둘러 근거리 공격을 하거나, 불꽃을 발사하여 원거리 공격을 합니다.",
    "뿔에 받히면 거대한 불꽃을 볼 수 있을지도 모릅니다.",
    "그의 후방에서 공격하면 발굽으로 차일 수도 있으니 조심하세요.",
  ],

  hp: [
    1661,1896,2145,2407,2684,3151,3669,4241,4871,5562,
    5952,6349,7060,7813,8611,9451,10335,10861,11390,11923,
    13114,14398,15780,17267,18864,20579,22419,24560,26866,29348,
    33108,36433,40046,43969,48225,52839,57838,63251,69108,75442,
    81649,88257,95284,102751,110678,119087,127997,137433,147417,157973,
    172029,183089,194773,207114,220146,233905,248429,263758,279935,297005,
    315189,333364,353148,372896,393537,414037,436300,458388,484819,513315,
    532271,550507,570354,589438,610197,630150,651840,672681,695322,714428,
    747764,782211,817791,854528,892446,931568,971920,1013526,1056409,1100596,
    1127550,1154929,1182737,1210975,1229658,1248482,1267449,1286557,1305808,1325201,
  ],

  attack: [
    66,75,85,96,107,118,129,141,153,166,
    179,192,205,219,233,248,263,278,294,310,
    328,345,364,382,401,421,441,461,482,503,
    546,584,625,668,712,758,807,857,910,965,
    1022,1081,1143,1207,1274,1343,1414,1489,1565,1645,
    1735,1820,1908,2000,2094,2152,2212,2272,2333,2395,
    2462,2528,2597,2664,2735,2805,2878,2949,3026,3102,
    3152,3201,3252,3301,3352,3401,3453,3503,3554,3604,
    3656,3708,3760,3812,3865,3918,3970,4023,4076,4130,
    4180,4231,4283,4334,4381,4428,4476,4524,4572,4620,
  ],

  defense: Array(100).fill(100),
} as const;