export const craghowler = {
  slug: "craghowler",

  code: "UNKNOWN",

  name: "거대한 록하울러",
  enName: "Craghowler",

  faction: "Talos II Wildlife",
  tier: "Boss",

  description:
    "록하울러 무리의 우두머리. 수많은 싸움 끝에 가장 강인한 록하울러가 무리의 우두머리가 되며, 이때의 거대한 록하울러는 이미 평범한 야수의 수준을 훨씬 뛰어넘는 전투 기술을 익힌 상태입니다.",

  summaryStats: {
    hp: {
      level1: 2008,
      level20: 14407,
      level40: 91159,
      level60: 358880,
      level80: 863267,
      level100: 1601284,
    },

    attack: {
      level1: 53,
      level20: 248,
      level40: 772,
      level60: 1916,
      level80: 2884,
      level100: 3696,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 320,
    staggerRecovery: "9s",

    finisherAtkMultiplier: 1.5,
    finisherSpGain: 50,

    critRate: 0,
    critDamage: 50,

    attackRange: 2.8,
    weight: 1.5,
  },

  resistances: {
    physical: {
      grade: "C",
      damageTaken: 80,
    },

    heat: {
      grade: "C",
      damageTaken: 80,
    },

    electric: {
      grade: "C",
      damageTaken: 80,
    },

    cold: {
      grade: "C",
      damageTaken: 80,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "분노 상태에 돌입하면 무작위로 유적의 낙석을 떨어뜨려 피해를 줍니다.",
    "유적의 남은 기둥을 능숙하게 활용하며 공격 범위가 매우 넓습니다.",
    "후퇴하는 척하다가 적이 방심한 틈을 타 바위를 던져 공격합니다.",
  ],

  hp: [
    2008,2291,2591,2909,3244,3807,4433,5124,5886,6720,
    7192,7672,8531,9441,10404,11420,12489,13124,13763,14407,
    15846,17397,19068,20864,22794,24867,27089,29677,32463,35462,
    40005,44023,48389,53129,58271,63847,69888,76429,83506,91159,
    98659,106644,115135,124158,133736,143896,154663,166065,178129,190883,
    207868,221233,235351,250263,266009,282635,300185,318708,338255,358880,
    380854,402815,426721,450582,475523,500295,527196,553886,585823,620256,
    643161,665196,689177,712238,737321,761431,787640,812822,840181,863267,
    903548,945171,988164,1032554,1078372,1125645,1174403,1224677,1276495,1329887,
    1362457,1395540,1429140,1463261,1485836,1508583,1531500,1554590,1577851,1601284,
  ],

  attack: [
    53,60,68,77,85,94,103,113,123,133,
    143,153,164,175,187,198,210,223,235,248,
    262,276,291,306,321,337,353,369,385,402,
    437,468,500,534,570,607,645,686,728,772,
    817,865,914,966,1019,1074,1132,1191,1252,1316,
    1388,1456,1527,1600,1675,1722,1769,1818,1866,1916,
    1970,2022,2077,2131,2188,2244,2302,2359,2421,2481,
    2522,2561,2601,2641,2682,2721,2762,2802,2844,2884,
    2925,2966,3008,3050,3092,3134,3176,3219,3261,3304,
    3344,3385,3426,3467,3505,3543,3581,3619,3657,3696,
  ],

  defense: Array(100).fill(100),
} as const;