export const effigy = {
  slug: "effigy",

  code: "AGL371",

  name: "형상아겔로스",
  enName: "Effigy",

  faction: "Aggeloi",
  tier: "Elite",

  description:
    "'호모이오사론'(보관 번호: AGL371), 인간의 신체 또는 특정 부위를 모방하는 형성 모델을 지니고 있으며, 매우 희귀하고 위험합니다. 일부 개체는 초자연 에너지를 조종할 수 있습니다.",

  summaryStats: {
    hp: {
      level1: 1246,
      level20: 8942,
      level40: 56582,
      level60: 222753,
      level80: 535821,
      level100: 993901,
    },

    attack: {
      level1: 66,
      level20: 310,
      level40: 965,
      level60: 2395,
      level80: 3604,
      level100: 4620,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 340,
    staggerRecovery: "9s",

    finisherAtkMultiplier: 1.5,
    finisherSpGain: 50,

    critRate: 0,
    critDamage: 50,

    attackRange: 12,
    weight: 2,
  },

  resistances: {
    physical: {
      grade: "C",
      damageTaken: 80,
    },

    heat: {
      grade: "C",
      damageTaken: 80,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "C",
      damageTaken: 80,
    },
  },

  traits: [
    "강력한 타격 수단을 다양하게 가지고 있지만, 공격할 때는 방향 전환 속도가 느리므로 후방에서 공격하는 것이 좋습니다.",
    "신체를 조합하여 다양한 형태로 변신하며 전장을 누빕니다.",
    "오퍼레이터를 속박하려고 시도합니다! 신속하게 움직임을 끊는 것이 효과적인 대응책입니다.",
  ],

  hp: [
    1246,1422,1608,1805,2013,2363,2752,3181,3653,4171,
    4464,4762,5295,5860,6458,7088,7752,8146,8543,8942,
    9835,10798,11835,12950,14148,15435,16814,18420,20150,22011,
    24831,27324,30034,32976,36168,39629,43379,47438,51831,56582,
    61237,66193,71463,77063,83009,89315,95998,103075,110563,118479,
    129022,137317,146080,155336,165109,175428,186322,197819,209951,222753,
    236392,250023,264861,279672,295152,310528,327225,343791,363615,384986,
    399204,412880,427765,442079,457648,472612,488880,504511,521492,535821,
    560823,586658,613343,640896,669334,698676,728940,760144,792307,825447,
    845663,866197,887052,908231,922243,936362,950586,964918,979356,993901,
  ],

  attack: [
    66,75,85,96,107,118,129,141,153,166,
    179,192,205,219,233,248,263,278,294,310,
    328,345,364,382,401,421,441,461,482,503,
    546,584,625,668,712,758,807,857,910,965,
    1022,1081,1143,1207,1274,1343,1414,1489,1565,1645,
    1735,1820,1908,2000,2094,2152,2212,2272,2333,2395,
    2462,2528,2597,2664,2735,2805,2878,2949,3026,3102,
    3152,3201,3252,3301,3352,3401,3453,3503,3554,3604,
    3656,3708,3760,3812,3865,3918,3970,4023,4076,4130,
    4180,4231,4283,4334,4381,4428,4476,4524,4572,4620,
  ],

  defense: Array(100).fill(100),
} as const;