export const eliteExecutioner = {
  slug: "elite-executioner",

  code: "UNKNOWN",

  name: "처형자 · 정예",
  enName: "Elite Executioner",

  faction: "Landbreaker",
  tier: "Elite",

  description:
    "안갯불의 강화를 받은, 중형 도끼를 장착한 정예 랜드브레이커, 큰 덩치를 자랑합니다. 이들은 보통 본 크러셔 집단 약탈팀의 우두머리로서 활동합니다.",

  summaryStats: {
    hp: {
      level1: 1661,
      level20: 11923,
      level40: 75442,
      level60: 297005,
      level80: 714428,
      level100: 1325201,
    },

    attack: {
      level1: 105,
      level20: 496,
      level40: 1543,
      level60: 3832,
      level80: 5767,
      level100: 7391,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 340,
    staggerRecovery: "9s",

    finisherAtkMultiplier: 1.5,
    finisherSpGain: 50,

    critRate: 0,
    critDamage: 50,

    attackRange: 2.8,
    weight: 1.5,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "잡기 공격에 당하면 대량의 피해를 받습니다. 오퍼레이터가 잡혔다면, 다른 오퍼레이터는 스킬을 사용하여 빠르게 적의 공격을 끊어 구출하세요.",
    "차지 2단 도끼 휘두르기를 사용하면 회피하기 어렵습니다. 빠르게 적의 공격을 끊으세요.",
  ],

  hp: [
    1661,1896,2145,2407,2684,3151,3669,4241,4871,5562,
    5952,6349,7060,7813,8611,9451,10335,10861,11390,11923,
    13114,14398,15780,17267,18864,20579,22419,24560,26866,29348,
    33108,36433,40046,43969,48225,52839,57838,63251,69108,75442,
    81649,88257,95284,102751,110678,119087,127997,137433,147417,157973,
    172029,183089,194773,207114,220146,233905,248429,263758,279935,297005,
    315189,333364,353148,372896,393537,414037,436300,458388,484819,513315,
    532271,550507,570354,589438,610197,630150,651840,672681,695322,714428,
    747764,782211,817791,854528,892446,931568,971920,1013526,1056409,1100596,
    1127550,1154929,1182737,1210975,1229658,1248482,1267449,1286557,1305808,1325201,
  ],

  attack: [
    105,121,137,153,171,188,207,226,245,265,
    286,307,328,351,374,397,421,445,470,496,
    524,553,582,612,642,673,705,737,771,804,
    873,935,1000,1068,1139,1214,1291,1372,1456,1543,
    1635,1730,1829,1931,2038,2148,2263,2382,2505,2632,
    2776,2913,3054,3199,3350,3443,3539,3635,3733,3832,
    3939,4045,4155,4263,4376,4488,4604,4719,4842,4963,
    5044,5122,5203,5281,5363,5442,5525,5604,5687,5767,
    5850,5933,6016,6100,6184,6268,6353,6437,6522,6607,
    6689,6770,6852,6934,7010,7086,7162,7238,7314,7391,
  ],

  defense: Array(100).fill(100),
} as const;