export const eliteAmbusher = {
  slug: "elite-ambusher",

  code: "UNKNOWN",

  name: "저격수 · 정예",
  enName: "Elite Ambusher",

  faction: "Landbreaker",
  tier: "Normal",

  description:
    "안갯불의 강화를 받은, 원거리 무기를 장착한 정예 무장 랜드브레이커, 훈련이 잘되어 있고, 높은 명중률을 자랑하며, 사용하는 화살이 전반적으로 강화되었습니다.",

  summaryStats: {
    hp: {
      level1: 263,
      level20: 1888,
      level40: 11945,
      level60: 47026,
      level80: 113118,
      level100: 209823,
    },

    attack: {
      level1: 38,
      level20: 178,
      level40: 555,
      level60: 1377,
      level80: 2073,
      level100: 2656,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 110,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 25,

    critRate: 0,
    critDamage: 50,

    attackRange: 7,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "해당 적은 특수 능력이 없습니다.",
  ],

  hp: [
    263,300,340,381,425,499,581,671,771,881,
    942,1005,1118,1237,1363,1496,1636,1720,1803,1888,
    2076,2280,2499,2734,2987,3258,3550,3889,4254,4647,
    5242,5769,6341,6962,7636,8366,9158,10015,10942,11945,
    12928,13974,15087,16269,17524,18855,20266,21760,23341,25012,
    27238,28989,30839,32793,34856,37035,39335,41762,44323,47026,
    49905,52783,55915,59042,62310,65556,69081,72578,76763,81275,
    84276,87164,90306,93328,96614,99774,103208,106508,110093,113118,
    118396,123850,129484,135300,141304,147498,153887,160475,167265,174261,
    178529,182864,187267,191738,194696,197676,200679,203705,206753,209823,
  ],

  attack: [
    38,43,49,55,61,68,74,81,88,95,
    103,110,118,126,134,143,151,160,169,178,
    188,199,209,220,231,242,253,265,277,289,
    314,336,359,384,409,436,464,493,523,555,
    588,622,657,694,732,772,813,856,900,946,
    998,1047,1097,1150,1204,1237,1272,1306,1342,1377,
    1416,1454,1493,1532,1573,1613,1655,1696,1740,1783,
    1813,1841,1870,1898,1927,1956,1985,2014,2044,2073,
    2102,2132,2162,2192,2222,2253,2283,2313,2344,2375,
    2404,2433,2462,2492,2519,2546,2574,2601,2629,2656,
  ],

  defense: Array(100).fill(100),
} as const;