export const eliteRipptusk = {
  slug: "elite-ripptusk",

  code: "UNKNOWN",

  name: "립터스크 · 정예",
  enName: "Elite Ripptusk",

  faction: "Landbreaker",
  tier: "Normal",

  description:
    "안갯불의 강화를 받은, 무장 랜드브레이커가 조종하는 정예 워비스트, 일반적인 터스크비스트보다 더 잔인하고 교활하며, 행동이 기이하여 예측하기 어렵습니다.",

  summaryStats: {
    hp: {
      level1: 228,
      level20: 1639,
      level40: 10373,
      level60: 40838,
      level80: 98234,
      level100: 182215,
    },

    attack: {
      level1: 39,
      level20: 186,
      level40: 579,
      level60: 1437,
      level80: 2163,
      level100: 2772,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 90,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 25,

    critRate: 0,
    critDamage: 50,

    attackRange: 2.1,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "유연하고 민첩하며, 표적이 된 목표에 계속 접근하며 공격합니다.",
  ],

  hp: [
    228,261,295,331,369,433,504,583,670,765,
    818,873,971,1074,1184,1300,1421,1493,1566,1639,
    1803,1980,2170,2374,2594,2830,3083,3377,3694,4035,
    4552,5009,5506,6046,6631,7265,7953,8697,9502,10373,
    11227,12135,13102,14128,15218,16374,17600,18897,20270,21721,
    23654,25175,26781,28478,30270,32162,34159,36267,38491,40838,
    43339,45838,48558,51273,54111,56930,59991,63028,66663,70581,
    73187,75695,78424,81048,83902,86646,89628,92494,95607,98234,
    102818,107554,112446,117498,122711,128091,133639,139360,145256,151332,
    155038,158803,162626,166509,169078,171666,174274,176902,179549,182215,
  ],

  attack: [
    39,45,51,58,64,71,78,85,92,99,
    107,115,123,132,140,149,158,167,176,186,
    197,207,218,229,241,252,264,277,289,302,
    327,351,375,401,427,455,484,514,546,579,
    613,649,686,724,764,806,849,893,939,987,
    1041,1092,1145,1200,1256,1291,1327,1363,1400,1437,
    1477,1517,1558,1599,1641,1683,1727,1770,1816,1861,
    1891,1921,1951,1980,2011,2041,2072,2102,2133,2163,
    2194,2225,2256,2287,2319,2351,2382,2414,2446,2478,
    2508,2539,2570,2600,2629,2657,2686,2714,2743,2772,
  ],

  defense: Array(100).fill(100),
} as const;