export const falsewingsAlpha = {
  slug: "falsewings-alpha",

  code: "ARA07Cα",

  name: "모방아겔로스 · α",
  enName: "Falsewings α",

  faction: "Aggeloi",
  tier: "Common",

  description:
    "'소스 탈론 · 아나본'(보관 번호: ARA07Cα), ARA07C의 활성 모델 생물류입니다. 일반적으로 원래 형성 모델과의 차이는 색상뿐이라고 여겨집니다.",

  summaryStats: {
    hp: {
      level1: 166,
      level20: 1192,
      level40: 7544,
      level60: 29700,
      level80: 71443,
      level100: 132520,
    },

    attack: {
      level1: 30,
      level20: 140,
      level40: 434,
      level60: 1078,
      level80: 1622,
      level100: 2079,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 60,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 25,

    critRate: 0,
    critDamage: 50,

    attackRange: 6,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "소형 회오리바람은 오퍼레이터를 감속시킵니다.",
  ],

  hp: [
    166,190,214,241,268,315,367,424,487,556,
    595,635,706,781,861,945,1034,1086,1139,1192,
    1311,1440,1578,1727,1886,2058,2242,2456,2687,2935,
    3311,3643,4005,4397,4822,5284,5784,6325,6911,7544,
    8165,8826,9528,10275,11068,11909,12800,13743,14742,15797,
    17203,18309,19477,20711,22015,23390,24843,26376,27994,29700,
    31519,33336,35315,37290,39354,41404,43630,45839,48482,51332,
    53227,55051,57035,58944,61020,63015,65184,67268,69532,71443,
    74776,78221,81779,85453,89245,93157,97192,101353,105641,110060,
    112755,115493,118274,121097,122966,124848,126745,128656,130581,132520,
  ],

  attack: [
    30,34,38,43,48,53,58,63,69,75,
    80,86,92,99,105,112,118,125,132,140,
    147,155,164,172,181,189,198,207,217,226,
    246,263,281,300,320,341,363,386,409,434,
    460,487,514,543,573,604,636,670,704,740,
    781,819,859,900,942,968,995,1022,1050,1078,
    1108,1138,1168,1199,1231,1262,1295,1327,1362,1396,
    1419,1440,1463,1485,1508,1531,1554,1576,1600,1622,
    1645,1669,1692,1716,1739,1763,1787,1810,1834,1858,
    1881,1904,1927,1950,1971,1993,2014,2036,2057,2079,
  ],

  defense: Array(100).fill(100),
} as const;