export const falsewings = {
  slug: "falsewings",

  code: "ARA07C",

  name: "모방아겔로스",
  enName: "Falsewings",

  faction: "Aggeloi",
  tier: "Common",

  description:
    "'소스 탈론'(보관 번호: ARA07C), 비행 능력은 외형과 무관합니다. 이러한 형성 모델은 처음에는 생물을 모방한 것으로 여겨졌으나, 현재는 테라인이 사용하는 비행선을 모방한 것이라는 것이 정설로 굳어졌습니다.",

  summaryStats: {
    hp: {
      level1: 111,
      level20: 795,
      level40: 5029,
      level60: 19800,
      level80: 47629,
      level100: 88347,
    },

    attack: {
      level1: 26,
      level20: 124,
      level40: 386,
      level60: 958,
      level80: 1442,
      level100: 1848,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 60,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 25,

    critRate: 0,
    critDamage: 50,

    attackRange: 6,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "소형 회오리바람은 오퍼레이터를 감속시킵니다.",
  ],

  hp: [
    111,126,143,160,179,210,245,283,325,371,
    397,423,471,521,574,630,689,724,759,795,
    874,960,1052,1151,1258,1372,1495,1637,1791,1957,
    2207,2429,2670,2931,3215,3523,3856,4217,4607,5029,
    5443,5884,6352,6850,7379,7939,8533,9162,9828,10532,
    11469,12206,12985,13808,14676,15594,16562,17584,18662,19800,
    21013,22224,23543,24860,26236,27602,29087,30559,32321,34221,
    35485,36700,38024,39296,40680,42010,43456,44845,46355,47629,
    49851,52147,54519,56969,59496,62105,64795,67568,70427,73373,
    75170,76995,78849,80732,81977,83232,84497,85770,87054,88347,
  ],

  attack: [
    26,30,34,38,43,47,52,56,61,66,
    71,77,82,88,93,99,105,111,118,124,
    131,138,145,153,161,168,176,184,193,201,
    218,234,250,267,285,303,323,343,364,386,
    409,432,457,483,509,537,566,595,626,658,
    694,728,763,800,837,861,885,909,933,958,
    985,1011,1039,1066,1094,1122,1151,1180,1210,1241,
    1261,1280,1301,1320,1341,1361,1381,1401,1422,1442,
    1462,1483,1504,1525,1546,1567,1588,1609,1631,1652,
    1672,1693,1713,1734,1752,1771,1790,1809,1829,1848,
  ],

  defense: Array(100).fill(100),
} as const;