export const glaringRakerbeast = {
  slug: "glaring-rakerbeast",

  code: "UNKNOWN",

  name: "분노의 레이커비스트",
  enName: "Glaring Rakerbeast",

  faction: "Talos II Wildlife",
  tier: "Elite",

  description:
    "레이커비스트의 특수 변이 색상형, 수명은 다소 짧아졌지만 더 강해졌습니다. 두 눈 속에는 마치 흐르는 불꽃이 깃든 듯합니다.",

  summaryStats: {
    hp: {
      level1: 1869,
      level20: 13413,
      level40: 84872,
      level60: 334130,
      level80: 803731,
      level100: 1490851,
    },

    attack: {
      level1: 72,
      level20: 341,
      level40: 1061,
      level60: 2635,
      level80: 3965,
      level100: 5081,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 320,
    staggerRecovery: "9s",

    finisherAtkMultiplier: 1.5,
    finisherSpGain: 50,

    critRate: 0,
    critDamage: 50,

    attackRange: 7,
    weight: 2,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "C",
      damageTaken: 80,
    },

    natural: {
      grade: "C",
      damageTaken: 80,
    },
  },

  traits: [
    "일반 레이커비스트와 달리, 생명력이 낮아지면 잠시 은신하며 차지합니다. 제때 차지를 끊으면 은신이 해제되며 대량의 불균형치를 쌓을 수 있습니다.",
    "분노 상태: 분노 상태에서 공격력이 증가하고, 차지 빈도가 더 높아집니다. 불균형 상태에 진입하면 분노 상태가 종료됩니다.",
  ],

  hp: [
    1869,2133,2413,2708,3020,3545,4127,4771,5480,6257,
    6696,7143,7942,8790,9687,10633,11627,12219,12814,13413,
    14753,16197,17753,19425,21222,23152,25221,27630,30225,33017,
    37246,40987,45051,49465,54253,59444,65068,71158,77747,84872,
    91855,99289,107195,115595,124513,133972,143997,154612,165844,177719,
    193533,205975,219120,233003,247664,263143,279482,296728,314927,334130,
    354588,375034,397292,419508,442729,465791,490838,515687,545422,577480,
    598805,619320,641648,663118,686471,708919,733320,756766,782237,803731,
    841235,879987,920015,961344,1004001,1048014,1093410,1140216,1188460,1238171,
    1268494,1299296,1330579,1362347,1383365,1404542,1425880,1447377,1469034,1490851,
  ],

  attack: [
    72,83,94,105,117,130,142,155,168,182,
    196,211,226,241,257,273,289,306,323,341,
    360,380,400,421,442,463,485,507,530,553,
    600,643,688,734,783,834,888,943,1001,1061,
    1124,1189,1257,1328,1401,1477,1556,1637,1722,1810,
    1909,2002,2099,2200,2303,2367,2433,2499,2566,2635,
    2708,2781,2856,2931,3009,3085,3165,3244,3329,3412,
    3468,3521,3577,3631,3687,3741,3798,3853,3910,3965,
    4022,4079,4136,4194,4251,4309,4367,4426,4484,4543,
    4599,4655,4711,4767,4819,4871,4924,4976,5029,5081,
  ],

  defense: Array(100).fill(100),
} as const;