export const hazefyreAxeArmorbeast = {
  slug: "hazefyre-axe-armorbeast",

  code: "UNKNOWN",

  name: "안갯불에 물든 엑스 아머비스트",
  enName: "Hazefyre Axe Armorbeast",

  faction: "Talos-II Wildlife",
  tier: "Elite",

  description:
    "안갯불에 물든 엑스 아머비스트, 성격이 극도로 난폭해져 이미 광기에 빠진 상태입니다. '거대한 도끼'에 쪼개지고 싶지 않다면, 주의해서 상대해야 합니다.",

  summaryStats: {
    hp: {
      level1: 1800,
      level20: 12916,
      level40: 81729,
      level60: 321755,
      level80: 773964,
      level100: 1435634,
    },

    attack: {
      level1: 72,
      level20: 341,
      level40: 1061,
      level60: 2635,
      level80: 3965,
      level100: 5081,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 320,
    staggerRecovery: "9s",

    finisherAtkMultiplier: 1.5,
    finisherSpGain: 50,

    critRate: 0,
    critDamage: 50,

    attackRange: 7,
    weight: 2,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "분노한 엑스 아머비스트는 자기 영역에 침입한 모든 적을 거대한 뿔로 몰아냅니다. 돌진을 반드시 조심하세요.",
    "여러 형태의 광역 범위 공격을 합니다. 놈이 분노하면 제때 공격을 중단시키세요.",
  ],

  hp: [
    1800,2054,2323,2608,2908,3413,3974,4594,5277,6025,
    6448,6879,7648,8465,9328,10239,11197,11766,12340,12916,
    14207,15598,17095,18706,20436,22294,24287,26607,29105,31794,
    35866,39469,43383,47633,52243,57242,62658,68522,74867,81729,
    88453,95611,103225,111314,119902,129010,138664,148886,159702,171137,
    186365,198347,211004,224374,238491,253397,269131,285738,303263,321755,
    341455,361144,382577,403970,426331,448540,472659,496587,525221,556092,
    576627,596382,617883,638558,661046,682662,706160,728737,753266,773964,
    810078,847395,885940,925738,966816,1009199,1052913,1097986,1144443,1192313,
    1221513,1251174,1281298,1311889,1332129,1352522,1373069,1393770,1414625,1435634,
  ],

  attack: [
    72,83,94,105,117,130,142,155,168,182,
    196,211,226,241,257,273,289,306,323,341,
    360,380,400,421,442,463,485,507,530,553,
    600,643,688,734,783,834,888,943,1001,1061,
    1124,1189,1257,1328,1401,1477,1556,1637,1722,1810,
    1909,2002,2099,2200,2303,2367,2433,2499,2566,2635,
    2708,2781,2856,2931,3009,3085,3165,3244,3329,3412,
    3468,3521,3577,3631,3687,3741,3798,3853,3910,3965,
    4022,4079,4136,4194,4251,4309,4367,4426,4484,4543,
    4599,4655,4711,4767,4819,4871,4924,4976,5029,5081,
  ],

  defense: Array(100).fill(100),
} as const;