export const hazefyreClaw = {
  slug: "hazefyre-claw",

  code: "UNKNOWN",

  name: "안갯불에 물든 랜드브레이커",
  enName: "Hazefyre Claw",

  faction: "Landbreaker",
  tier: "Normal",

  description:
    "안갯불에 물든 무장 랜드브레이커, 안갯불을 흡수하는 게 반드시 행운인 것은 아닙니다. 이 랜드브레이커들은 심각한 왜곡을 겪었습니다.",

  summaryStats: {
    hp: {
      level1: 249,
      level20: 1788,
      level40: 11316,
      level60: 44551,
      level80: 107164,
      level100: 198780,
    },

    attack: {
      level1: 36,
      level20: 171,
      level40: 531,
      level60: 1317,
      level80: 1982,
      level100: 2541,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 100,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 25,

    critRate: 0,
    critDamage: 50,

    attackRange: 2.3,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "C",
      damageTaken: 80,
    },

    heat: {
      grade: "C",
      damageTaken: 80,
    },

    electric: {
      grade: "C",
      damageTaken: 80,
    },

    cold: {
      grade: "C",
      damageTaken: 80,
    },

    natural: {
      grade: "C",
      damageTaken: 80,
    },
  },

  traits: [
    "연속 물어뜯기 공격을 피하면 바닥에 넘어집니다.",
  ],

  hp: [
    249,284,322,361,403,473,550,636,731,834,
    893,952,1059,1172,1292,1418,1550,1629,1709,1788,
    1967,2160,2367,2590,2830,3087,3363,3684,4030,4402,
    4966,5465,6007,6595,7234,7926,8676,9488,10366,11316,
    12247,13239,14293,15413,16602,17863,19200,20615,22113,23696,
    25804,27463,29216,31067,33022,35086,37264,39564,41990,44551,
    47278,50005,52972,55934,59030,62106,65445,68758,72723,76997,
    79841,82576,85553,88416,91530,94522,97776,100902,104298,107164,
    112165,117332,122669,128179,133867,139735,145788,152029,158461,165089,
    169133,173239,177410,181646,184449,187272,190117,192984,195871,198780,
  ],

  attack: [
    36,41,47,53,59,65,71,78,84,91,
    98,105,113,121,128,136,145,153,162,171,
    180,190,200,210,221,231,242,254,265,276,
    300,321,344,367,392,417,444,472,500,531,
    562,595,629,664,701,739,778,819,861,905,
    954,1001,1050,1100,1151,1184,1216,1250,1283,1317,
    1354,1390,1428,1465,1504,1543,1583,1622,1664,1706,
    1734,1761,1789,1815,1844,1871,1899,1926,1955,1982,
    2011,2039,2068,2097,2126,2155,2184,2213,2242,2271,
    2299,2327,2355,2384,2410,2436,2462,2488,2514,2541,
  ],

  defense: Array(100).fill(100),
} as const;