export const heavyStingAlpha = {
  slug: "heavy-sting-alpha",

  code: "ARL141α",

  name: "삼미아겔로스 · α",
  enName: "Heavy Sting α",

  faction: "Aggeloi",
  tier: "Advanced",

  description:
    "'바리켄트론 아나본'(보관 번호: ARL141α), ARL141의 활성 모델 생물류입니다. 기존의 다양한 공격 방식을 유지하면서 형성 모델의 견고함을 높여 위험합니다.",

  summaryStats: {
    hp: {
      level1: 1094,
      level20: 7849,
      level40: 49666,
      level60: 195528,
      level80: 470332,
      level100: 872424,
    },

    attack: {
      level1: 59,
      level20: 279,
      level40: 868,
      level60: 2156,
      level80: 3244,
      level100: 4158,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 180,
    staggerRecovery: "7.5s",

    finisherAtkMultiplier: 1.25,
    finisherSpGain: 35,

    critRate: 0,
    critDamage: 50,

    attackRange: 7,
    weight: 1.5,
  },

  resistances: {
    physical: {
      grade: "C",
      damageTaken: 80,
    },

    heat: {
      grade: "C",
      damageTaken: 80,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "C",
      damageTaken: 80,
    },
  },

  traits: [
    "오퍼레이터의 발 아래에서 오리지늄 기둥이 솟아오르며 공격합니다.",
    "가까이 접근하면 자신 주변에 돌기둥을 소환하여 스스로를 보호합니다.",
  ],

  hp: [
    1094,1248,1412,1585,1767,2074,2415,2792,3207,3661,
    3918,4180,4648,5144,5669,6222,6804,7150,7499,7849,
    8633,9478,10389,11367,12419,13548,14759,16169,17687,19321,
    21796,23985,26363,28946,31748,34786,38077,41640,45496,49666,
    53752,58102,62729,67645,72863,78399,84265,90477,97050,103999,
    113252,120534,128226,136350,144929,153987,163549,173641,184291,195528,
    207500,219465,232489,245490,259078,272574,287231,301772,319173,337933,
    350412,362417,375483,388047,401713,414849,429128,442848,457754,470332,
    492278,514955,538379,562564,587527,613282,639847,667238,695469,724559,
    742304,760329,778635,797225,809525,821917,834404,846983,859657,872424,
  ],

  attack: [
    59,68,77,86,96,106,116,127,138,149,
    161,173,185,197,210,223,237,251,265,279,
    295,311,327,344,361,379,397,415,433,452,
    491,526,563,601,641,683,726,772,819,868,
    920,973,1029,1086,1146,1208,1273,1340,1409,1481,
    1562,1638,1718,1800,1884,1937,1990,2045,2100,2156,
    2216,2275,2337,2398,2462,2524,2590,2654,2723,2792,
    2837,2881,2927,2971,3017,3061,3108,3152,3199,3244,
    3291,3337,3384,3431,3478,3526,3573,3621,3669,3717,
    3762,3808,3854,3900,3943,3986,4028,4071,4114,4158,
  ],

  defense: Array(100).fill(100),
} as const;