export const hedron = {
  slug: "hedron",

  code: "ARM315",

  name: "수정아겔로스",
  enName: "Hedron",

  faction: "Aggeloi",
  tier: "Common",

  description:
    "'다이파스타그란'(보관 번호: ARM315), 에너지를 투척하는 액체 형성 모델, 복잡하고 대칭적인 기하학적 외형을 지녔으며, 공격하면 접촉한 면에서 열을 빼앗습니다.",

  summaryStats: {
    hp: {
      level1: 152,
      level20: 1093,
      level40: 6916,
      level60: 27225,
      level80: 65489,
      level100: 121477,
    },

    attack: {
      level1: 26,
      level20: 124,
      level40: 386,
      level60: 958,
      level80: 1442,
      level100: 1848,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 60,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 25,

    critRate: 0,
    critDamage: 50,

    attackRange: 2.1,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "C",
      damageTaken: 80,
    },

    cold: {
      grade: "C",
      damageTaken: 80,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "발사한 총알이 명중하면 오퍼레이터에게 냉기 부착을 부여합니다.",
  ],

  hp: [
    152,174,197,221,246,289,336,389,446,510,
    546,582,647,716,789,866,947,996,1044,1093,
    1202,1320,1447,1583,1729,1886,2055,2251,2463,2690,
    3035,3340,3671,4030,4421,4844,5302,5798,6335,6916,
    7485,8090,8734,9419,10146,10916,11733,12598,13513,14481,
    15769,16783,17854,18985,20180,21441,22773,24178,25661,27225,
    28892,30558,32372,34182,36074,37953,39994,42019,44442,47054,
    48792,50463,52282,54032,55935,57764,59752,61662,63738,65489,
    68545,71703,74964,78332,81808,85394,89093,92907,96838,100888,
    103359,105869,108418,111006,112719,114444,116183,117934,119699,121477,
  ],

  attack: [
    26,30,34,38,43,47,52,56,61,66,
    71,77,82,88,93,99,105,111,118,124,
    131,138,145,153,161,168,176,184,193,201,
    218,234,250,267,285,303,323,343,364,386,
    409,432,457,483,509,537,566,595,626,658,
    694,728,763,800,837,861,885,909,933,958,
    985,1011,1039,1066,1094,1122,1151,1180,1210,1241,
    1261,1280,1301,1320,1341,1361,1381,1401,1422,1442,
    1462,1483,1504,1525,1546,1567,1588,1609,1631,1652,
    1672,1693,1713,1734,1752,1771,1790,1809,1829,1848,
  ],

  defense: Array(100).fill(100),
} as const;