export const hedronDelta = {
  slug: "hedron-delta",

  code: "ARM315δ",

  name: "수정아겔로스 · δ",
  enName: "Hedron δ",

  faction: "Aggeloi",
  tier: "Common",

  description:
    "'다이파스타그란 · 다이네든'(보관 번호: ARM315δ), ARM315의 격류종, 햇빛 아래에서 눈부신 보랏빛 광채를 내뿜습니다. 탈로스의 반사광 아래에서는 전혀 다른 모습이 드러납니다.",

  summaryStats: {
    hp: {
      level1: 208,
      level20: 1490,
      level40: 9430,
      level60: 37126,
      level80: 89303,
      level100: 165650,
    },

    attack: {
      level1: 30,
      level20: 140,
      level40: 434,
      level60: 1078,
      level80: 1622,
      level100: 2079,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 90,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 25,

    critRate: 0,
    critDamage: 50,

    attackRange: 6,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "C",
      damageTaken: 80,
    },

    cold: {
      grade: "C",
      damageTaken: 80,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "발사한 총알이 명중하면 오퍼레이터에게 냉기 부착을 부여합니다.",
  ],

  hp: [
    208,237,268,301,336,394,459,530,609,695,
    744,794,882,977,1076,1181,1292,1358,1424,1490,
    1639,1800,1973,2158,2358,2572,2802,3070,3358,3669,
    4138,4554,5006,5496,6028,6605,7230,7906,8639,9430,
    10206,11032,11911,12844,13835,14886,16000,17179,18427,19747,
    21504,22886,24347,25889,27518,29238,31054,32970,34992,37126,
    39399,41670,44144,46612,49192,51755,54538,57299,60602,64164,
    66534,68813,71294,73680,76275,78769,81480,84085,86915,89303,
    93471,97776,102224,106816,111556,116446,121490,126691,132051,137575,
    140944,144366,147842,151372,153707,156060,158431,160820,163226,165650,
  ],

  attack: [
    30,34,38,43,48,53,58,63,69,75,
    80,86,92,99,105,112,118,125,132,140,
    147,155,164,172,181,189,198,207,217,226,
    246,263,281,300,320,341,363,386,409,434,
    460,487,514,543,573,604,636,670,704,740,
    781,819,859,900,942,968,995,1022,1050,1078,
    1108,1138,1168,1199,1231,1262,1295,1327,1362,1396,
    1419,1440,1463,1485,1508,1531,1554,1576,1600,1622,
    1645,1669,1692,1716,1739,1763,1787,1810,1834,1858,
    1881,1904,1927,1950,1971,1993,2014,2036,2057,2079,
  ],

  defense: Array(100).fill(100),
} as const;