export const hillSmasher = {
  slug: "hill-smasher",

  code: "UNKNOWN",

  name: "최산장",
  enName: "Hill Smasher",

  faction: "Outlaw",
  tier: "Elite",

  description:
    "중형 무기를 장착한 불법 무장 세력. 최산장의 4연장 발사기는 산을 뒤흔들 정도의 진정한 중화기이므로 절대로 방심해서는 안 됩니다.",

  summaryStats: {
    hp: {
      level1: 1108,
      level20: 7948,
      level40: 50295,
      level60: 198003,
      level80: 476285,
      level100: 883467,
    },

    attack: {
      level1: 59,
      level20: 279,
      level40: 868,
      level60: 2156,
      level80: 3244,
      level100: 4158,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 320,
    staggerRecovery: "9s",

    finisherAtkMultiplier: 1.5,
    finisherSpGain: 50,

    critRate: 0,
    critDamage: 50,

    attackRange: 2.8,
    weight: 1.5,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "C",
      damageTaken: 80,
    },

    electric: {
      grade: "C",
      damageTaken: 80,
    },

    cold: {
      grade: "C",
      damageTaken: 80,
    },

    natural: {
      grade: "C",
      damageTaken: 80,
    },
  },

  traits: [
    "대포를 휘둘러 근거리 공격을 하거나, 불꽃을 발사하여 원거리 공격을 합니다.",
    "뿔에 받히면 거대한 불꽃을 볼 수 있을지도 모릅니다.",
    "그의 후방에서 공격하면 발굽으로 차일 수도 있으니 조심하세요.",
  ],

  hp: [
    1108,1264,1430,1605,1790,2101,2446,2827,3247,3708,
    3968,4233,4707,5209,5740,6301,6890,7241,7594,7948,
    8743,9598,10520,11511,12576,13720,14946,16373,17911,19565,
    22072,24288,26697,29312,32150,35226,38559,42168,46072,50295,
    54433,58838,63523,68501,73786,79391,85332,91622,98278,105315,
    114686,122059,129849,138076,146764,155936,165619,175839,186624,198003,
    210126,222243,235432,248597,262358,276025,290867,305592,323213,342210,
    354848,367004,380236,392959,406798,420100,434560,448454,463548,476285,
    498510,521474,545194,569685,594964,621046,647947,675684,704273,733731,
    751700,769953,788491,807316,819772,832321,844966,857705,870538,883467,
  ],

  attack: [
    59,68,77,86,96,106,116,127,138,149,
    161,173,185,197,210,223,237,251,265,279,
    295,311,327,344,361,379,397,415,433,452,
    491,526,563,601,641,683,726,772,819,868,
    920,973,1029,1086,1146,1208,1273,1340,1409,1481,
    1562,1638,1718,1800,1884,1937,1990,2045,2100,2156,
    2216,2275,2337,2398,2462,2524,2590,2654,2723,2792,
    2837,2881,2927,2971,3017,3061,3108,3152,3199,3244,
    3291,3337,3384,3431,3478,3526,3573,3621,3669,3717,
    3762,3808,3854,3900,3943,3986,4028,4071,4114,4158,
  ],

  defense: Array(100).fill(100),
} as const;