export const imbuedQuillbeast = {
  slug: "imbued-quillbeast",

  code: "UNKNOWN",

  name: "활성화된 프릭비스트",
  enName: "Imbued Quillbeast",

  faction: "Talos II Wildlife",
  tier: "Enhanced",

  description:
    "활성 오리지늄 분진의 영향을 받은 프릭비스트, 온몸의 가시에 상당한 에너지를 저장하고 있으며 더 강한 파괴력을 지녔습니다.",

  summaryStats: {
    hp: {
      level1: 1246,
      level20: 8942,
      level40: 56582,
      level60: 222753,
      level80: 535821,
      level100: 993901,
    },

    attack: {
      level1: 44,
      level20: 209,
      level40: 651,
      level60: 1617,
      level80: 2433,
      level100: 3118,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 200,
    staggerRecovery: "7s",

    finisherAtkMultiplier: 1.25,
    finisherSpGain: 35,

    critRate: 0,
    critDamage: 50,

    attackRange: 6,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "C",
      damageTaken: 80,
    },

    electric: {
      grade: "C",
      damageTaken: 80,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "차지하여 배를 부풀린 뒤 체내의 고열 용암을 분사합니다. 차지 중에 끊으면 대량의 불균형치를 쌓을 수 있습니다.",
    "분노 상태: 분노 상태에서 공격력이 증가하고 차지 빈도가 더 높아집니다. 불균형 상태에 진입하면 분노 상태가 종료됩니다.",
  ],

  hp: [
    1246,1422,1608,1805,2013,2363,2752,3181,3653,4171,
    4464,4762,5295,5860,6458,7088,7752,8146,8543,8942,
    9835,10798,11835,12950,14148,15435,16814,18420,20150,22011,
    24831,27324,30034,32976,36168,39629,43379,47438,51831,56582,
    61237,66193,71463,77063,83009,89315,95998,103075,110563,118479,
    129022,137317,146080,155336,165109,175428,186322,197819,209951,222753,
    236392,250023,264861,279672,295152,310528,327225,343791,363615,384986,
    399204,412880,427765,442079,457648,472612,488880,504511,521492,535821,
    560823,586658,613343,640896,669334,698676,728940,760144,792307,825447,
    845663,866197,887052,908231,922243,936362,950586,964918,979356,993901,
  ],

  attack: [
    44,51,58,65,72,79,87,95,103,112,
    121,129,139,148,158,167,178,188,198,209,
    221,233,245,258,271,284,297,311,325,339,
    368,395,422,451,481,512,545,579,614,651,
    690,730,772,815,860,906,955,1005,1057,1110,
    1171,1229,1288,1350,1413,1453,1493,1534,1575,1617,
    1662,1706,1753,1798,1846,1893,1942,1991,2043,2094,
    2128,2161,2195,2228,2263,2296,2331,2364,2399,2433,
    2468,2503,2538,2573,2609,2644,2680,2716,2752,2788,
    2822,2856,2891,2925,2957,2989,3021,3053,3086,3118,
  ],

  defense: Array(100).fill(100),
} as const;