export const indigenousPincerbeast = {
  slug: "indigenous-pincerbeast",

  code: "UNKNOWN",

  name: "원시 핀서비스트",
  enName: "Indigenous Pincerbeast",

  faction: "Originium Beast",
  tier: "Normal",

  description:
    "야생의 감염된 생물, 등에 대량의 오리지늄 클러스터를 짊어지고 있으며 체구가 거대합니다. 낫처럼 생긴 앞다리로 사냥감을 찢어발길 수 있습니다.",

  summaryStats: {
    hp: {
      level1: 166,
      level20: 1192,
      level40: 7544,
      level60: 29700,
      level80: 71443,
      level100: 132520,
    },

    attack: {
      level1: 26,
      level20: 124,
      level40: 386,
      level60: 958,
      level80: 1442,
      level100: 1848,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 60,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 25,

    critRate: 0,
    critDamage: 50,

    attackRange: 6,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "보통 무리를 지어 나타납니다.",
    "놈들의 날카로운 앞다리를 조심하세요.",
  ],

  hp: [
    166,190,214,241,268,315,367,424,487,556,
    595,635,706,781,861,945,1034,1086,1139,1192,
    1311,1440,1578,1727,1886,2058,2242,2456,2687,2935,
    3311,3643,4005,4397,4822,5284,5784,6325,6911,7544,
    8165,8826,9528,10275,11068,11909,12800,13743,14742,15797,
    17203,18309,19477,20711,22015,23390,24843,26376,27994,29700,
    31519,33336,35315,37290,39354,41404,43630,45839,48482,51332,
    53227,55051,57035,58944,61020,63015,65184,67268,69532,71443,
    74776,78221,81779,85453,89245,93157,97192,101353,105641,110060,
    112755,115493,118274,121097,122966,124848,126745,128656,130581,132520,
  ],

  attack: [
    26,30,34,38,43,47,52,56,61,66,
    71,77,82,88,93,99,105,111,118,124,
    131,138,145,153,161,168,176,184,193,201,
    218,234,250,267,285,303,323,343,364,386,
    409,432,457,483,509,537,566,595,626,658,
    694,728,763,800,837,861,885,909,933,958,
    985,1011,1039,1066,1094,1122,1151,1180,1210,1241,
    1261,1280,1301,1320,1341,1361,1381,1401,1422,1442,
    1462,1483,1504,1525,1546,1567,1588,1609,1631,1652,
    1672,1693,1713,1734,1752,1771,1790,1809,1829,1848,
  ],

  defense: Array(100).fill(100),
} as const;