export const marbleAggelomoirai = {
  slug: "marble-aggelomoirai",

  code: "UNKNOWN",

  name: "마블 아겔로미레",
  enName: "Marble Aggelomoirai",

  faction: "Aggeloi",
  tier: "Boss",

  description:
    "미분류, 형성 특징으로 보아 아겔로스로 추정됩니다. 형성 모델이 재구성되었으나 여전히 네파리스의 외형을 모방하였습니다. 모든 추가 추정 결론은 신뢰할 수 없는 것으로 판단됩니다.",

  summaryStats: {
    hp: {
      level1: 2077,
      level20: 14903,
      level40: 94303,
      level60: 371256,
      level80: 893035,
      level100: 1656501,
    },

    attack: {
      level1: 33,
      level20: 155,
      level40: 482,
      level60: 1198,
      level80: 1802,
      level100: 2310,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 200,
    staggerRecovery: "24s",

    finisherAtkMultiplier: 1.75,
    finisherSpGain: 100,

    critRate: 0,
    critDamage: 50,

    attackRange: 12,
    weight: 2,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "모든 마블 부속체를 처치해야만, 수면 상태의 마블 아겔로미레가 잠시 동안 공격할 수 있는 핵심 부위를 드러냅니다.",
  ],

  hp: [
    2077,2370,2681,3009,3355,3939,4586,5301,6089,6952,
    7440,7937,8825,9767,10763,11814,12919,13576,14238,14903,
    16392,17997,19725,21583,23580,25724,28024,30700,33583,36685,
    41384,45541,50057,54961,60281,66049,72298,79064,86385,94303,
    102061,110321,119105,128439,138348,148858,159997,171792,184271,197466,
    215036,228861,243467,258893,275182,292381,310536,329698,349919,371256,
    393987,416705,441435,466119,491921,517546,545375,572985,606024,641644,
    665339,688133,712942,736798,762746,787687,814800,840851,869153,893035,
    934705,977763,1022238,1068160,1115557,1164460,1214900,1266907,1320512,1375745,
    1409438,1443662,1478421,1513718,1537072,1560603,1584311,1608196,1632260,1656501,
  ],

  attack: [
    33,38,43,48,53,59,65,71,77,83,
    89,96,103,110,117,124,132,139,147,155,
    164,173,182,191,201,210,220,230,241,251,
    273,292,313,334,356,379,403,429,455,482,
    511,541,571,604,637,671,707,744,783,823,
    868,910,954,1000,1047,1076,1106,1136,1167,1198,
    1231,1264,1298,1332,1368,1402,1439,1475,1513,1551,
    1576,1600,1626,1650,1676,1701,1726,1751,1777,1802,
    1828,1854,1880,1906,1932,1959,1985,2012,2038,2065,
    2090,2116,2141,2167,2191,2214,2238,2262,2286,2310,
  ],

  defense: Array(100).fill(100),
} as const;