export const marbleAppendage = {
  slug: "marble-appendage",

  code: "UNKNOWN",

  name: "마블 부속체",
  enName: "Marble Appendage",

  faction: "Aggeloi",
  tier: "Boss",

  description:
    "미분류, 형성 특징으로 보아 아겔로스로 추정됩니다. 외관상 본체에서 확장된 것처럼 보이지만, 실제로는 형성 위치에서 본체로 확장된 것입니다. 이는 적을 교란하기 위한 전략으로 추정됩니다.",

  summaryStats: {
    hp: {
      level1: 235,
      level20: 1689,
      level40: 10688,
      level60: 42076,
      level80: 101211,
      level100: 187737,
    },

    attack: {
      level1: 59,
      level20: 279,
      level40: 868,
      level60: 2156,
      level80: 3244,
      level100: 4158,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 0,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1.25,
    finisherSpGain: 100,

    critRate: 0,
    critDamage: 50,

    attackRange: 12,
    weight: 2,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "일부 마블 부속체는 근거리 적을 공격하는 데 특화되어 있으며, 지면을 미친 듯이 내리칩니다.",
    "일부 마블 부속체는 원거리 적을 공격하는 데 특화되어 있으며, 자신의 끝부분을 침식으로 분쇄해 적에게 투척합니다.",
  ],

  hp: [
    235,269,304,341,380,446,520,601,690,788,
    843,900,1000,1107,1220,1339,1464,1539,1614,1689,
    1858,2040,2236,2446,2672,2915,3176,3479,3806,4158,
    4690,5161,5673,6229,6832,7486,8194,8961,9790,10688,
    11567,12503,13499,14556,15679,16871,18133,19470,20884,22379,
    24371,25938,27593,29341,31187,33136,35194,37366,39658,42076,
    44652,47227,50029,52827,55751,58655,61809,64938,68683,72720,
    75405,77988,80800,83504,86445,89271,92344,95296,98504,101211,
    105933,110813,115854,121058,126430,131972,137689,143583,149658,155918,
    159736,163615,167554,171555,174201,176868,179555,182262,184989,187737,
  ],

  attack: [
    59,68,77,86,96,106,116,127,138,149,
    161,173,185,197,210,223,237,251,265,279,
    295,311,327,344,361,379,397,415,433,452,
    491,526,563,601,641,683,726,772,819,868,
    920,973,1029,1086,1146,1208,1273,1340,1409,1481,
    1562,1638,1718,1800,1884,1937,1990,2045,2100,2156,
    2216,2275,2337,2398,2462,2524,2590,2654,2723,2792,
    2837,2881,2927,2971,3017,3061,3108,3152,3199,3244,
    3291,3337,3384,3431,3478,3526,3573,3621,3669,3717,
    3762,3808,3854,3900,3943,3986,4028,4071,4114,4158,
  ],

  defense: Array(100).fill(100),
} as const;