export const mudflowDelta = {
  slug: "mudflow-delta",

  code: "ACM311δ",

  name: "탁류아겔로스 · δ",
  enName: "Mudflow δ",

  faction: "Aggeloi",
  tier: "Common",

  description:
    "'토레이그란 · 다이네든'(보관 번호: ACM311δ), ACM311의 격류종, 에너지를 다루는 방식이 특이하여, 내부 온도가 구성 물질의 어는 점보다 낮습니다.",

  summaryStats: {
    hp: {
      level1: 291,
      level20: 2086,
      level40: 13202,
      level60: 51976,
      level80: 125025,
      level100: 231910,
    },

    attack: {
      level1: 30,
      level20: 140,
      level40: 434,
      level60: 1078,
      level80: 1622,
      level100: 2079,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 90,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 25,

    critRate: 0,
    critDamage: 50,

    attackRange: 2.1,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "C",
      damageTaken: 80,
    },

    cold: {
      grade: "C",
      damageTaken: 80,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "멀리서 빠르게 접근하며, 공격이 명중하면 오퍼레이터에게 냉기 부착을 부여합니다.",
  ],

  hp: [
    291,332,375,421,470,551,642,742,852,973,
    1042,1111,1235,1367,1507,1654,1809,1901,1993,2086,
    2295,2520,2762,3022,3301,3601,3923,4298,4702,5136,
    5794,6376,7008,7695,8439,9247,10122,11069,12094,13202,
    14289,15445,16675,17981,19369,20840,22400,24051,25798,27645,
    30105,32041,34085,36245,38526,40933,43475,46158,48989,51976,
    55158,58339,61801,65257,68869,72456,76353,80218,84843,89830,
    93147,96339,99812,103152,106784,110276,114072,117719,121681,125025,
    130859,136887,143113,149542,156178,163024,170086,177367,184872,192604,
    197321,202113,206979,211921,215190,218484,221803,225147,228516,231910,
  ],

  attack: [
    30,34,38,43,48,53,58,63,69,75,
    80,86,92,99,105,112,118,125,132,140,
    147,155,164,172,181,189,198,207,217,226,
    246,263,281,300,320,341,363,386,409,434,
    460,487,514,543,573,604,636,670,704,740,
    781,819,859,900,942,968,995,1022,1050,1078,
    1108,1138,1168,1199,1231,1262,1295,1327,1362,1396,
    1419,1440,1463,1485,1508,1531,1554,1576,1600,1622,
    1645,1669,1692,1716,1739,1763,1787,1810,1834,1858,
    1881,1904,1927,1950,1971,1993,2014,2036,2057,2079,
  ],

  defense: Array(100).fill(100),
} as const;