export const mudflow = {
  slug: "mudflow",

  code: "ACM311",

  name: "탁류아겔로스",
  enName: "Mudflow",

  faction: "Aggeloi",
  tier: "Common",

  description:
    "'토레이그란'(보관 번호: ACM311), 인류가 처음 발견한 액체를 사용한 형성 모델, 헤일로의 외형이 불안정하며, 일반적으로 내부 온도가 구성 물질보다 낮습니다.",

  summaryStats: {
    hp: {
      level1: 180,
      level20: 1292,
      level40: 8173,
      level60: 32175,
      level80: 77396,
      level100: 143563,
    },

    attack: {
      level1: 26,
      level20: 124,
      level40: 386,
      level60: 958,
      level80: 1442,
      level100: 1848,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 60,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 25,

    critRate: 0,
    critDamage: 50,

    attackRange: 2.1,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "C",
      damageTaken: 80,
    },

    cold: {
      grade: "C",
      damageTaken: 80,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "멀리서 빠르게 접근하며, 공격이 명중하면 오퍼레이터에게 냉기 부착을 부여합니다.",
  ],

  hp: [
    180,205,232,261,291,341,397,459,528,603,
    645,688,765,846,933,1024,1120,1177,1234,1292,
    1421,1560,1710,1871,2044,2229,2429,2661,2911,3179,
    3587,3947,4338,4763,5224,5724,6266,6852,7487,8173,
    8845,9561,10322,11131,11990,12901,13866,14889,15970,17114,
    18636,19835,21100,22437,23849,25340,26913,28574,30326,32175,
    34146,36114,38258,40397,42633,44854,47266,49659,52522,55609,
    57663,59638,61788,63856,66105,68266,70616,72874,75327,77396,
    81008,84739,88594,92574,96682,100920,105291,109799,114444,119231,
    122151,125117,128130,131189,133213,135252,137307,139377,141462,143563,
  ],

  attack: [
    26,30,34,38,43,47,52,56,61,66,
    71,77,82,88,93,99,105,111,118,124,
    131,138,145,153,161,168,176,184,193,201,
    218,234,250,267,285,303,323,343,364,386,
    409,432,457,483,509,537,566,595,626,658,
    694,728,763,800,837,861,885,909,933,958,
    985,1011,1039,1066,1094,1122,1151,1180,1210,1241,
    1261,1280,1301,1320,1341,1361,1381,1401,1422,1442,
    1462,1483,1504,1525,1546,1567,1588,1609,1631,1652,
    1672,1693,1713,1734,1752,1771,1790,1809,1829,1848,
  ],

  defense: Array(100).fill(100),
} as const;