export const nefarithConqueror = {
  slug: "nefarith-conqueror",

  code: "UNKNOWN",

  name: "'정복자' 네파리스",
  enName: "Nefarith, Conqueror",

  faction: "Landbreaker",
  tier: "Boss",

  description:
    "정복자의 심상. 그녀는 문명을 유린하고자 하는 욕망을 조금도 감추지 않았습니다.",

  summaryStats: {
    hp: {
      level1: 2631,
      level20: 18878,
      level40: 119450,
      level60: 470257,
      level80: 1131178,
      level100: 2098235,
    },

    attack: {
      level1: 39,
      level20: 186,
      level40: 579,
      level60: 1437,
      level80: 2163,
      level100: 2772,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 480,
    staggerRecovery: "16s",

    finisherAtkMultiplier: 1.75,
    finisherSpGain: 100,

    critRate: 0,
    critDamage: 50,

    attackRange: 12,
    weight: 2,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "평소에는 초자연 보호막의 보호를 받아, 받는 피해가 크게 감소합니다. 차지를 끊어야만 보호막을 잠시 해제할 수 있습니다.",
    "시공간을 찢어 오퍼레이터를 행동 불가 상태로 만드는 능력을 지니고 있습니다. 이런 종류의 스킬은 가장 먼저 끊어야 합니다.",
    "앵커로 아군 오퍼레이터를 가두므로, 앵커를 공격해 오퍼레이터를 구출해야 합니다.",
  ],

  hp: [
    2631,3002,3396,3811,4250,4989,5809,6715,7712,8806,
    9424,10053,11178,12371,13633,14964,16364,17197,18035,18878,
    20764,22796,24985,27339,29869,32584,35497,38887,42538,46468,
    52420,57685,63406,69617,76356,83662,91577,100148,109422,119450,
    129278,139740,150867,162690,175241,188554,202663,217603,233410,250123,
    272379,289891,308391,327931,348564,370349,393346,417617,443231,470257,
    499050,527826,559152,590418,623100,655558,690809,725781,767631,812749,
    842763,871636,903060,933278,966145,997737,1032080,1065078,1100927,1131178,
    1183960,1238500,1294835,1353002,1413039,1474983,1538874,1604749,1672648,1742611,
    1785288,1828638,1872666,1917377,1946958,1976763,2006794,2037049,2067529,2098235,
  ],

  attack: [
    39,45,51,58,64,71,78,85,92,99,
    107,115,123,132,140,149,158,167,176,186,
    197,207,218,229,241,252,264,277,289,302,
    327,351,375,401,427,455,484,514,546,579,
    613,649,686,724,764,806,849,893,939,987,
    1041,1092,1145,1200,1256,1291,1327,1363,1400,1437,
    1477,1517,1558,1599,1641,1683,1727,1770,1816,1861,
    1891,1921,1951,1980,2011,2041,2072,2102,2133,2163,
    2194,2225,2256,2287,2319,2351,2382,2414,2446,2478,
    2508,2539,2570,2600,2629,2657,2686,2714,2743,2772,
  ],

  defense: Array(100).fill(100),
} as const;
