export const nefarithBonekrusher = {
  slug: "nefarith-bonekrusher",

  code: "UNKNOWN",

  name: "'본 크러셔' 네파리스",
  enName: "Nefarith, Bonekrusher",

  faction: "Landbreaker",
  tier: "Boss",

  description:
    "'본 크러셔'라는 이름은 네파리스로 인해 밴드 전역에 울려 퍼졌습니다. 그녀의 잔혹한 여행은 끝난 적이 없고, 그녀의 야심 또한 아직 온전히 드러나지 않았습니다.",

  summaryStats: {
    hp: {
      level1: 2354,
      level20: 16890,
      level40: 106876,
      level60: 420756,
      level80: 1012106,
      level100: 1877368,
    },

    attack: {
      level1: 46,
      level20: 217,
      level40: 675,
      level60: 1677,
      level80: 2523,
      level100: 3234,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 480,
    staggerRecovery: "11s",

    finisherAtkMultiplier: 1.75,
    finisherSpGain: 100,

    critRate: 0,
    critDamage: 50,

    attackRange: 12,
    weight: 2,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "회피로는 피할 수 없는 초자연 에너지 파동을 베어 냅니다.",
    "장방이의 식양 지원을 이용해 공중으로 점프해 회피해야 합니다.",
    "공중으로 점프해 차지 공격을 가합니다.",
    "식양을 이용해 뛰어오른 후 낙하 공격으로 번개를 소환해 적의 공격을 끊어야 합니다.",
  ],

  hp: [
    2354,2686,3038,3410,3803,4464,5197,6008,6900,7879,
    8432,8995,10001,11069,12198,13389,14642,15386,16136,16890,
    18578,20397,22355,24461,26724,29154,31760,34793,38060,41576,
    46902,51613,56731,62289,68318,74855,81938,89606,97904,106876,
    115670,125030,134986,145564,156794,168706,181330,194697,208841,223794,
    243708,259376,275929,293412,311873,331365,351941,373658,396575,420756,
    446518,472266,500293,528269,557510,586552,618092,649383,686827,727197,
    754051,779884,808001,835038,864445,892712,923440,952964,985040,1012106,
    1059333,1108132,1158537,1210581,1264298,1319722,1376887,1435828,1496580,1559178,
    1597363,1636150,1675543,1715547,1742015,1768683,1795552,1822622,1849894,1877368,
  ],

  attack: [
    46,53,60,67,75,82,90,99,107,116,
    125,134,144,153,163,174,184,195,206,217,
    229,242,255,268,281,295,308,323,337,352,
    382,409,438,467,498,531,565,600,637,675,
    715,757,800,845,892,940,990,1042,1096,1152,
    1215,1274,1336,1400,1466,1507,1548,1590,1633,1677,
    1723,1769,1818,1865,1915,1963,2014,2064,2118,2171,
    2207,2241,2276,2311,2346,2381,2417,2452,2488,2523,
    2559,2596,2632,2669,2705,2742,2779,2816,2853,2891,
    2926,2962,2998,3034,3067,3100,3133,3167,3200,3234,
  ],

  defense: Array(100).fill(100),
} as const;