export const quillbeast = {
  slug: "quillbeast",

  code: "UNKNOWN",

  name: "프릭비스트",
  enName: "Quillbeast",

  faction: "Talos-II Wildlife",
  tier: "Enhanced",

  description:
    "야생의 프릭비스트, 탈로스 II의 토착 동물입니다. 몸의 뾰족한 가시를 세우고 구르기 시작하면, 전기톱에 버금가는 파괴력을 지닙니다.",

  summaryStats: {
    hp: {
      level1: 831,
      level20: 5961,
      level40: 37721,
      level60: 148502,
      level80: 357214,
      level100: 662600,
    },

    attack: {
      level1: 39,
      level20: 186,
      level40: 579,
      level60: 1437,
      level80: 2163,
      level100: 2772,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 200,
    staggerRecovery: "7s",

    finisherAtkMultiplier: 1.25,
    finisherSpGain: 35,

    critRate: 0,
    critDamage: 50,

    attackRange: 6,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "C",
      damageTaken: 80,
    },

    electric: {
      grade: "C",
      damageTaken: 80,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "분노 상태: 분노 상태에서 공격력이 증가하고, 차지 빈도가 더 높아집니다. 불균형 상태에 진입하면 분노 상태가 종료됩니다.",
  ],

  hp: [
    831,948,1072,1204,1342,1575,1834,2120,2435,2781,
    2976,3175,3530,3907,4305,4726,5168,5431,5695,5961,
    6557,7199,7890,8633,9432,10290,11209,12280,13433,14674,
    16554,18216,20023,21984,24112,26419,28919,31626,34554,37721,
    40825,44128,47642,51376,55339,59543,63999,68717,73709,78986,
    86014,91545,97387,103557,110073,116952,124214,131879,139968,148502,
    157595,166682,176574,186448,196768,207018,218150,229194,242410,256658,
    266136,275253,285177,294719,305098,315075,325920,336340,347661,357214,
    373882,391105,408895,427264,446223,465784,485960,506763,528205,550298,
    563775,577465,591368,605487,614829,624241,633724,643278,652904,662600,
  ],

  attack: [
    39,45,51,58,64,71,78,85,92,99,
    107,115,123,132,140,149,158,167,176,186,
    197,207,218,229,241,252,264,277,289,302,
    327,351,375,401,427,455,484,514,546,579,
    613,649,686,724,764,806,849,893,939,987,
    1041,1092,1145,1200,1256,1291,1327,1363,1400,1437,
    1477,1517,1558,1599,1641,1683,1727,1770,1816,1861,
    1891,1921,1951,1980,2011,2041,2072,2102,2133,2163,
    2194,2225,2256,2287,2319,2351,2382,2414,2446,2478,
    2508,2539,2570,2600,2629,2657,2686,2714,2743,2772,
  ],

  defense: Array(100).fill(100),
} as const;