export const rhodagnTheBonekrushingFist = {
  slug: "rhodagn-the-bonekrushing-fist",

  code: "UNKNOWN",

  name: "'본 크러셔의 주먹' 로댄",
  enName: "Rhodagn the Bonekrushing Fist",

  faction: "Landbreaker",
  tier: "Boss",

  description:
    "네파리스의 '오른팔', 본 크러셔 집단의 최강 전사, 과거 수많은 랜드브레이커들이 네파리스의 권위에 도전했지만, 그들의 야망은 로댄의 주먹에 하나씩 산산조각이 났습니다.",

  summaryStats: {
    hp: {
      level1: 3461,
      level20: 24839,
      level40: 157171,
      level60: 618759,
      level80: 1488392,
      level100: 2760835,
    },

    attack: {
      level1: 66,
      level20: 310,
      level40: 965,
      level60: 2395,
      level80: 3604,
      level100: 4620,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 280,
    staggerRecovery: "10s",

    finisherAtkMultiplier: 1.75,
    finisherSpGain: 100,

    critRate: 0,
    critDamage: 50,

    attackRange: 12,
    weight: 2,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "중무장한 적, 몸의 통풍구를 이용해 상대방을 자신의 주변으로 끌어들여 공격합니다.",
    "지옥의 용광로에서 에너지를 흡수하여 자신의 능력을 강화합니다.",
    "로댄이 뿜는 화염을 조심하세요.",
  ],

  hp: [
    3461,3950,4468,5015,5592,6564,7643,8835,10148,11587,
    12400,13228,14708,16278,17939,19690,21532,22627,23730,24839,
    27320,29995,32875,35972,39301,42874,46706,51167,55971,61142,
    68974,75901,83429,91601,100468,110081,120497,131773,143976,157171,
    170102,183868,198509,214065,230580,248097,266661,286319,307119,329109,
    358394,381436,405778,431488,458637,487301,517560,549496,583199,618759,
    656645,694508,735726,776866,819868,862577,908959,954975,1010040,1069407,
    1108899,1146889,1188237,1227997,1271243,1312812,1357999,1401418,1448588,1488392,
    1557842,1629606,1703731,1780266,1859262,1940767,2024834,2111512,2200853,2292909,
    2349063,2406103,2464034,2522864,2561787,2601005,2640518,2680327,2720433,2760835,
  ],

  attack: [
    66,75,85,96,107,118,129,141,153,166,
    179,192,205,219,233,248,263,278,294,310,
    328,345,364,382,401,421,441,461,482,503,
    546,584,625,668,712,758,807,857,910,965,
    1022,1081,1143,1207,1274,1343,1414,1489,1565,1645,
    1735,1820,1908,2000,2094,2152,2212,2272,2333,2395,
    2462,2528,2597,2664,2735,2805,2878,2949,3026,3102,
    3152,3201,3252,3301,3352,3401,3453,3503,3554,3604,
    3656,3708,3760,3812,3865,3918,3970,4023,4076,4130,
    4180,4231,4283,4334,4381,4428,4476,4524,4572,4620,
  ],

  defense: Array(100).fill(100),
} as const;