export const roadPlunderer = {
  slug: "road-plunderer",

  code: "UNKNOWN",

  name: "막류재",
  enName: "Road Plunderer",

  faction: "Outlaw",
  tier: "Normal",

  description:
    "무릉 관할 지역에서 활동하는 불법 무장 세력, 사설 검문소를 운영하며 불법 물품을 밀수합니다. 홍산 치안 부대의 주요 단속 대상입니다.",

  summaryStats: {
    hp: {
      level1: 194,
      level20: 1391,
      level40: 8802,
      level60: 34651,
      level80: 83350,
      level100: 154607,
    },

    attack: {
      level1: 33,
      level20: 155,
      level40: 482,
      level60: 1198,
      level80: 1802,
      level100: 2310,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 80,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 25,

    critRate: 0,
    critDamage: 50,

    attackRange: 2.3,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "해당 적은 특수 능력이 없습니다.",
  ],

  hp: [
    194,221,250,281,313,368,428,495,568,649,
    694,741,824,912,1005,1103,1206,1267,1329,1391,
    1530,1680,1841,2014,2201,2401,2616,2865,3134,3424,
    3863,4250,4672,5130,5626,6165,6748,7379,8063,8802,
    9526,10297,11116,11988,12912,13893,14933,16034,17199,18430,
    20070,21360,22724,24163,25684,27289,28983,30772,32659,34651,
    36772,38892,41201,43504,45913,48304,50902,53479,56562,59887,
    62098,64226,66541,68768,71190,73517,76048,78479,81121,83350,
    87239,91258,95409,99695,104119,108683,113391,118245,123248,128403,
    131548,134742,137986,141280,143460,145656,147869,150098,152344,154607,
  ],

  attack: [
    33,38,43,48,53,59,65,71,77,83,
    89,96,103,110,117,124,132,139,147,155,
    164,173,182,191,201,210,220,230,241,251,
    273,292,313,334,356,379,403,429,455,482,
    511,541,571,604,637,671,707,744,783,823,
    868,910,954,1000,1047,1076,1106,1136,1167,1198,
    1231,1264,1298,1332,1368,1402,1439,1475,1513,1551,
    1576,1600,1626,1650,1676,1701,1726,1751,1777,1802,
    1828,1854,1880,1906,1932,1959,1985,2012,2038,2065,
    2090,2116,2141,2167,2191,2214,2238,2262,2286,2310,
  ],

  defense: Array(100).fill(100),
} as const;