export const rockhowler = {
  slug: "rockhowler",

  code: "UNKNOWN",

  name: "록하울러",
  enName: "Rockhowler",

  faction: "Talos II Wildlife",
  tier: "Normal",

  description:
    "야생의 록하울러. 영리하면서도 장난기 많은 이 동물은 종종 사람을 골탕 먹이기 위해 함정을 파놓기도 합니다. 사람들이 잔뜩 약이 오른 모습을 보는 것을 좋아하므로 침착하게 대응하는 것이 중요합니다.",

  summaryStats: {
    hp: {
      level1: 138,
      level20: 994,
      level40: 6287,
      level60: 24750,
      level80: 59536,
      level100: 110433,
    },

    attack: {
      level1: 13,
      level20: 62,
      level40: 193,
      level60: 479,
      level80: 721,
      level100: 924,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 60,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 25,

    critRate: 0,
    critDamage: 50,

    attackRange: 6,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "C",
      damageTaken: 80,
    },

    heat: {
      grade: "C",
      damageTaken: 80,
    },

    electric: {
      grade: "C",
      damageTaken: 80,
    },

    cold: {
      grade: "C",
      damageTaken: 80,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "무리를 지어 출몰하는 습성이 있습니다. 록하울러가 던진 바나나 껍질을 밟으면 오퍼레이터와 록하울러 모두 미끄러져 넘어집니다.",
  ],

  hp: [
    138,158,179,201,224,263,306,353,406,463,
    496,529,588,651,718,788,861,905,949,994,
    1093,1200,1315,1439,1572,1715,1868,2047,2239,2446,
    2759,3036,3337,3664,4019,4403,4820,5271,5759,6287,
    6804,7355,7940,8563,9223,9924,10666,11453,12285,13164,
    14336,15257,16231,17260,18345,19492,20702,21980,23328,24750,
    26266,27780,29429,31075,32795,34503,36358,38199,40402,42776,
    44356,45876,47529,49120,50850,52512,54320,56057,57944,59536,
    62314,65184,68149,71211,74370,77631,80993,84460,88034,91716,
    93963,96244,98561,100915,102471,104040,105621,107213,108817,110433,
  ],

  attack: [
    13,15,17,19,21,24,26,28,31,33,
    36,38,41,44,47,50,53,56,59,62,
    66,69,73,76,80,84,88,92,96,101,
    109,117,125,134,142,152,161,171,182,193,
    204,216,229,241,255,269,283,298,313,329,
    347,364,382,400,419,430,442,454,467,479,
    492,506,519,533,547,561,576,590,605,620,
    630,640,650,660,670,680,691,701,711,721,
    731,742,752,762,773,784,794,805,815,826,
    836,846,857,867,876,886,895,905,914,924,
  ],

  defense: Array(100).fill(100),
} as const;