export const ruanYi = {
  slug: "ruan-yi",

  code: "UNKNOWN",

  name: "원일",
  enName: "Ruan Yi",

  faction: "Outlaw",
  tier: "Boss",

  description:
    "오랜 고통 끝에, 순식간에 사라질 수 있는 '기회' 앞에서, 원일은 더 이상 마음속 불꽃을 억누르지 않습니다.",

  summaryStats: {
    hp: {
      level1: 3323,
      level20: 23845,
      level40: 150884,
      level60: 594009,
      level80: 1428856,
      level100: 2650402,
    },

    attack: {
      level1: 66,
      level20: 310,
      level40: 965,
      level60: 2395,
      level80: 3604,
      level100: 4620,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 300,
    staggerRecovery: "15s",

    finisherAtkMultiplier: 1.75,
    finisherSpGain: 100,

    critRate: 0,
    critDamage: 50,

    attackRange: 12,
    weight: 2,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "C",
      damageTaken: 80,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "C",
      damageTaken: 80,
    },
  },

  traits: [
    "원일은 모든 공격을 튕겨 냅니다. 식양을 이용하여 원일의 방어를 파괴해야만 피해를 줄 수 있습니다.",
    "생명력이 일정 이하로 떨어지면 격노 상태에 진입합니다.",
    "식양을 이용하면 해당 상태를 해제하고, 장시간의 허약 상태에 빠뜨릴 수 있습니다.",
    "원일은 격노 상태일 때, 메인 컨트롤 오퍼레이터가 가까이 다가가면 폭발하는 분노의 씨앗을 소환합니다.",
    "전장에는 전투를 돕는 식양 에너지가 모입니다.",
    "결정적인 순간에 식양 에너지와 접촉해 활성화하면, 원일을 억제할 수 있습니다.",
  ],

  hp: [
    3323,3792,4289,4814,5369,6302,7337,8482,9742,11123,
    11904,12699,14120,15627,17221,18903,20671,21722,22781,23845,
    26228,28795,31560,34534,37729,41159,44838,49120,53732,58696,
    66215,72865,80091,87937,96449,105678,115677,126503,138217,150884,
    163298,176513,190568,205503,221357,238173,255995,274866,294834,315945,
    344058,366178,389546,414228,440291,467809,496858,527516,559871,594009,
    630379,666728,706297,745791,787073,828074,872601,916776,969639,1026631,
    1064543,1101013,1140707,1178877,1220393,1260300,1303679,1345361,1390644,1428856,
    1495529,1564421,1635581,1709055,1784891,1863137,1943840,2027051,2112818,2201192,
    2255101,2309859,2365473,2421949,2459315,2496964,2534897,2573114,2611615,2650402,
  ],

  attack: [
    66,75,85,96,107,118,129,141,153,166,
    179,192,205,219,233,248,263,278,294,310,
    328,345,364,382,401,421,441,461,482,503,
    546,584,625,668,712,758,807,857,910,965,
    1022,1081,1143,1207,1274,1343,1414,1489,1565,1645,
    1735,1820,1908,2000,2094,2152,2212,2272,2333,2395,
    2462,2528,2597,2664,2735,2805,2878,2949,3026,3102,
    3152,3201,3252,3301,3352,3401,3453,3503,3554,3604,
    3656,3708,3760,3812,3865,3918,3970,4023,4076,4130,
    4180,4231,4283,4334,4381,4428,4476,4524,4572,4620,
  ],

  defense: Array(100).fill(100),
} as const;