export const spottedRakerbeast = {
  slug: "spotted-rakerbeast",

  code: "UNKNOWN",

  name: "백안의 레이커비스트",
  enName: "Spotted Rakerbeast",

  faction: "Talos-II Wildlife",
  tier: "Elite",

  description:
    "자연 환경에 서식하는 레이커비스트, 탈로스 II의 토착 동물입니다. 뛰어난 점프력과 날카로운 발톱을 지닌, 산림 지대의 최상위 포식자입니다.",

  summaryStats: {
    hp: {
      level1: 1108,
      level20: 7948,
      level40: 50295,
      level60: 198003,
      level80: 476285,
      level100: 883467,
    },

    attack: {
      level1: 66,
      level20: 310,
      level40: 965,
      level60: 2395,
      level80: 3604,
      level100: 4620,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 320,
    staggerRecovery: "9s",

    finisherAtkMultiplier: 1.5,
    finisherSpGain: 50,

    critRate: 0,
    critDamage: 50,

    attackRange: 7,
    weight: 2,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "C",
      damageTaken: 80,
    },

    natural: {
      grade: "C",
      damageTaken: 80,
    },
  },

  traits: [
    "몸놀림이 민첩하며, 발톱과 꼬리로 공격합니다. 주의해서 피하세요.",
    "분노 상태에서는 공격력이 증가하고 차지 공격 빈도가 더 높아집니다. 불균형 상태에 진입하면 분노 상태가 종료됩니다.",
  ],

  hp: [
    1108,1264,1430,1605,1790,2101,2446,2827,3247,3708,
    3968,4233,4707,5209,5740,6301,6890,7241,7594,7948,
    8743,9598,10520,11511,12576,13720,14946,16373,17911,19565,
    22072,24288,26697,29312,32150,35226,38559,42168,46072,50295,
    54433,58838,63523,68501,73786,79391,85332,91622,98278,105315,
    114686,122059,129849,138076,146764,155936,165619,175839,186624,198003,
    210126,222243,235432,248597,262358,276025,290867,305592,323213,342210,
    354848,367004,380236,392959,406798,420100,434560,448454,463548,476285,
    498510,521474,545194,569685,594964,621046,647947,675684,704273,733731,
    751700,769953,788491,807316,819772,832321,844966,857705,870538,883467,
  ],

  attack: [
    66,75,85,96,107,118,129,141,153,166,
    179,192,205,219,233,248,263,278,294,310,
    328,345,364,382,401,421,441,461,482,503,
    546,584,625,668,712,758,807,857,910,965,
    1022,1081,1143,1207,1274,1343,1414,1489,1565,1645,
    1735,1820,1908,2000,2094,2152,2212,2272,2333,2395,
    2462,2528,2597,2664,2735,2805,2878,2949,3026,3102,
    3152,3201,3252,3301,3352,3401,3453,3503,3554,3604,
    3656,3708,3760,3812,3865,3918,3970,4023,4076,4130,
    4180,4231,4283,4334,4381,4428,4476,4524,4572,4620,
  ],

  defense: Array(100).fill(100),
} as const;