export const tidalklast = {
  slug: "tidalklast",

  code: "AGM32L",

  name: "파조의 상",
  enName: "Tidalklast",

  faction: "Aggeloi",
  tier: "Alpha",

  description:
    "'아나파크뤼단'(보관 번호: AGM32L), AGM321의 비모델 생물류입니다. 개체 크기는 일정하지 않으며, 대형 개체가 파도를 가르며 솟구쳐 오르는 모습은 많은 사람들에게 악몽으로 남아있습니다.",

  summaryStats: {
    hp: {
      level1: 1385,
      level20: 9936,
      level40: 62869,
      level60: 247504,
      level80: 595357,
      level100: 1104334,
    },

    attack: {
      level1: 66,
      level20: 310,
      level40: 965,
      level60: 2395,
      level80: 3604,
      level100: 4620,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 640,
    staggerRecovery: "13s",

    finisherAtkMultiplier: 1.5,
    finisherSpGain: 50,

    critRate: 0,
    critDamage: 50,

    attackRange: 2.8,
    weight: 1.5,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "C",
      damageTaken: 80,
    },

    cold: {
      grade: "C",
      damageTaken: 80,
    },

    natural: {
      grade: "D",
      damageTaken: 100,
    },
  },

  traits: [
    "원거리와 근거리 두 가지 상태를 가지고 있습니다.",
    "근거리 상태: 목표에 접근하여 근거리 전투를 벌입니다.",
    "원거리 상태: 거리를 유지하며 더 강력한 능력으로 공격합니다.",
    "원거리 상태에서는 열기 피해를 더 많이 받지만, 다른 유형의 피해는 현저히 적게 받습니다.",
  ],

  hp: [
    1385,1580,1787,2006,2237,2626,3057,3534,4059,4635,
    4960,5291,5883,6511,7176,7876,8613,9051,9492,9936,
    10928,11998,13150,14389,15720,17149,18682,20467,22389,24457,
    27590,30361,33371,36640,40187,44032,48199,52709,57590,62869,
    68041,73547,79403,85626,92232,99239,106664,114528,122848,131644,
    143357,152574,162311,172595,183455,194921,207024,219799,233279,247504,
    262658,277803,294290,310746,327947,345031,363584,381990,404016,427763,
    443559,458756,475295,491199,508497,525125,543200,560567,579435,595357,
    623137,651842,681492,712106,743705,776307,809933,844605,880341,917164,
    939625,962441,985614,1009146,1024715,1040402,1056207,1072131,1088173,1104334,
  ],

  attack: [
    66,75,85,96,107,118,129,141,153,166,
    179,192,205,219,233,248,263,278,294,310,
    328,345,364,382,401,421,441,461,482,503,
    546,584,625,668,712,758,807,857,910,965,
    1022,1081,1143,1207,1274,1343,1414,1489,1565,1645,
    1735,1820,1908,2000,2094,2152,2212,2272,2333,2395,
    2462,2528,2597,2664,2735,2805,2878,2949,3026,3102,
    3152,3201,3252,3301,3352,3401,3453,3503,3554,3604,
    3656,3708,3760,3812,3865,3918,3970,4023,4076,4130,
    4180,4231,4283,4334,4381,4428,4476,4524,4572,4620,
  ],

  defense: Array(100).fill(100),
} as const;