export const tunnelingNidwyrm = {
  slug: "tunneling-nidwyrm",

  code: "UNKNOWN",

  name: "터널링 니드웜",
  enName: "Tunneling Nidwyrm",

  faction: "Beast",
  tier: "Enhanced",

  description:
    "강한 부식성 액체를 뿜어내는 야수, 대부분의 시간을 지하에 숨어 지냅니다. 산성 액체로 금속을 녹인 다음 삼켜버리는 게 습관입니다. 교전할 때는 무기가 상하지 않도록 잘 보호하세요.",

  summaryStats: {
    hp: {
      level1: 692,
      level20: 4968,
      level40: 31434,
      level60: 123752,
      level80: 297678,
      level100: 552167,
    },

    attack: {
      level1: 56,
      level20: 264,
      level40: 820,
      level60: 2036,
      level80: 3064,
      level100: 3927,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 160,
    staggerRecovery: "7s",

    finisherAtkMultiplier: 1.25,
    finisherSpGain: 35,

    critRate: 0,
    critDamage: 50,

    attackRange: 12,
    weight: 2,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "C",
      damageTaken: 70,
    },
  },

  traits: [
    "적이 분사하는 독액을 조심하세요.",
    "독액에 빠지면 지속적으로 자연 피해를 입습니다.",
  ],

  hp: [
    692,790,894,1003,1118,1313,1529,1767,2030,2317,
    2480,2646,2942,3256,3588,3938,4306,4525,4746,4968,
    5464,5999,6575,7194,7860,8575,9341,10233,11194,12228,
    13795,15180,16686,18320,20094,22016,24099,26355,28795,31434,
    34020,36774,39702,42813,46116,49619,53332,57264,61424,65822,
    71679,76287,81156,86298,91727,97460,103512,109899,116640,123752,
    131329,138902,147145,155373,163974,172515,181792,190995,202008,213881,
    221780,229378,237647,245599,254249,262562,271600,280284,289718,297678,
    311568,325921,340746,356053,371852,388153,404967,422302,440171,458582,
    469813,481221,492807,504573,512357,520201,528104,536065,544087,552167,
  ],

  attack: [
    56,64,73,82,91,100,110,120,130,141,
    152,163,174,186,198,211,224,237,250,264,
    278,294,309,325,341,358,375,392,409,427,
    464,497,531,567,605,645,686,729,773,820,
    868,919,972,1026,1083,1141,1202,1265,1331,1398,
    1475,1547,1622,1700,1780,1829,1880,1931,1983,2036,
    2093,2149,2207,2265,2325,2384,2446,2507,2572,2636,
    2679,2721,2764,2806,2849,2891,2935,2977,3021,3064,
    3108,3152,3196,3241,3285,3330,3375,3420,3465,3510,
    3553,3597,3640,3684,3724,3764,3805,3845,3886,3927,
  ],

  defense: Array(100).fill(100),
} as const;