export const walkingChrysopolis = {
  slug: "walking-chrysopolis",

  code: "ACL156",

  name: "결정아겔로스",
  enName: "Walking Chrysopolis",

  faction: "Aggeloi",
  tier: "Alpha",

  description:
    "'투리오론'(보관 번호: ACL156), 헤일로가 전면의 방패형 구조로 완전히 보호된 형성 모델, 에너지를 사용해 먼 거리에 있는 목표를 앞으로 끌어당길 수 있으니 주의해서 상대해야 합니다.",

  summaryStats: {
    hp: {
      level1: 1385,
      level20: 9936,
      level40: 62869,
      level60: 247504,
      level80: 595357,
      level100: 1104334,
    },

    attack: {
      level1: 59,
      level20: 279,
      level40: 868,
      level60: 2156,
      level80: 3244,
      level100: 4158,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 320,
    staggerRecovery: "9s",

    finisherAtkMultiplier: 1.5,
    finisherSpGain: 50,

    critRate: 0,
    critDamage: 50,

    attackRange: 2.8,
    weight: 1.5,
  },

  resistances: {
    physical: {
      grade: "C",
      damageTaken: 80,
    },

    heat: {
      grade: "C",
      damageTaken: 80,
    },

    electric: {
      grade: "D",
      damageTaken: 100,
    },

    cold: {
      grade: "C",
      damageTaken: 80,
    },

    natural: {
      grade: "C",
      damageTaken: 80,
    },
  },

  traits: [
    "결정아겔로스는 일반과 방벽 전개 두 가지 형태를 가지고 있습니다.",
    "일반 상태: 멀리 있는 오퍼레이터를 앞으로 끌어당기는 능력을 가지고 있습니다.",
    "방벽 전개 상태: 정면과 측면의 공격을 반사하지만, 동시에 등 뒤의 약점을 노출합니다.",
  ],

  hp: [
    1385,1580,1787,2006,2237,2626,3057,3534,4059,4635,
    4960,5291,5883,6511,7176,7876,8613,9051,9492,9936,
    10928,11998,13150,14389,15720,17149,18682,20467,22389,24457,
    27590,30361,33371,36640,40187,44032,48199,52709,57590,62869,
    68041,73547,79403,85626,92232,99239,106664,114528,122848,131644,
    143357,152574,162311,172595,183455,194921,207024,219799,233279,247504,
    262658,277803,294290,310746,327947,345031,363584,381990,404016,427763,
    443559,458756,475295,491199,508497,525125,543200,560567,579435,595357,
    623137,651842,681492,712106,743705,776307,809933,844605,880341,917164,
    939625,962441,985614,1009146,1024715,1040402,1056207,1072131,1088173,1104334,
  ],

  attack: [
    59,68,77,86,96,106,116,127,138,149,
    161,173,185,197,210,223,237,251,265,279,
    295,311,327,344,361,379,397,415,433,452,
    491,526,563,601,641,683,726,772,819,868,
    920,973,1029,1086,1146,1208,1273,1340,1409,1481,
    1562,1638,1718,1800,1884,1937,1990,2045,2100,2156,
    2216,2275,2337,2398,2462,2524,2590,2654,2723,2792,
    2837,2881,2927,2971,3017,3061,3108,3152,3199,3244,
    3291,3337,3384,3431,3478,3526,3573,3621,3669,3717,
    3762,3808,3854,3900,3943,3986,4028,4071,4114,4158,
  ],

  defense: Array(100).fill(100),
} as const;