export const waterlamp = {
  slug: "waterlamp",

  code: "UNKNOWN",

  name: "수등충",
  enName: "Waterlamp",

  faction: "Talos-II Wildlife",
  tier: "Normal",

  description:
    "야생의 수생 곤충, 은은한 빛을 발산합니다. 복강 내의 자극성 체액은 피부 알레르기와 화상을 유발할 수 있으니 주의해서 상대해야 합니다.",

  summaryStats: {
    hp: {
      level1: 111,
      level20: 795,
      level40: 5029,
      level60: 19800,
      level80: 47629,
      level100: 88347,
    },

    attack: {
      level1: 26,
      level20: 124,
      level40: 386,
      level60: 958,
      level80: 1442,
      level100: 1848,
    },

    defense: {
      level1: 100,
      level20: 100,
      level40: 100,
      level60: 100,
      level80: 100,
      level100: 100,
    },
  },

  battleStats: {
    staggerHp: 80,
    staggerRecovery: "6s",

    finisherAtkMultiplier: 1,
    finisherSpGain: 25,

    critRate: 0,
    critDamage: 50,

    attackRange: 6,
    weight: 1,
  },

  resistances: {
    physical: {
      grade: "D",
      damageTaken: 100,
    },

    heat: {
      grade: "D",
      damageTaken: 100,
    },

    electric: {
      grade: "C",
      damageTaken: 80,
    },

    cold: {
      grade: "D",
      damageTaken: 100,
    },

    natural: {
      grade: "C",
      damageTaken: 80,
    },
  },

  traits: [
    "머리에서 축적한 산성 액체를 내뿜습니다. 오퍼레이터에게 명중 시 방어력이 감소하며, 위협적으로 보이지 않더라도 주의해야 합니다.",
  ],

  hp: [
    111,126,143,160,179,210,245,283,325,371,
    397,423,471,521,574,630,689,724,759,795,
    874,960,1052,1151,1258,1372,1495,1637,1791,1957,
    2207,2429,2670,2931,3215,3523,3856,4217,4607,5029,
    5443,5884,6352,6850,7379,7939,8533,9162,9828,10532,
    11469,12206,12985,13808,14676,15594,16562,17584,18662,19800,
    21013,22224,23543,24860,26236,27602,29087,30559,32321,34221,
    35485,36700,38024,39296,40680,42010,43456,44845,46355,47629,
    49851,52147,54519,56969,59496,62105,64795,67568,70427,73373,
    75170,76995,78849,80732,81977,83232,84497,85770,87054,88347,
  ],

  attack: [
    26,30,34,38,43,47,52,56,61,66,
    71,77,82,88,93,99,105,111,118,124,
    131,138,145,153,161,168,176,184,193,201,
    218,234,250,267,285,303,323,343,364,386,
    409,432,457,483,509,537,566,595,626,658,
    694,728,763,800,837,861,885,909,933,958,
    985,1011,1039,1066,1094,1122,1151,1180,1210,1241,
    1261,1280,1301,1320,1341,1361,1381,1401,1422,1442,
    1462,1483,1504,1525,1546,1567,1588,1609,1631,1652,
    1672,1693,1713,1734,1752,1771,1790,1809,1829,1848,
  ],

  defense: Array(100).fill(100),
} as const;